haskell/haskell_handling_exceptions.org
#+INCLUDE: ../theme/style.org
#+TITLE: Exception Handling 

* Exception Handling 
** Overview 

Exceptions are events that happens during run-time that disrupts the
normal flow of execution. The common sources of exceptions are
partial functions (functions not defined to all its domain),
user-thrown exceptions and IO. 

The Haskell static typing system by itself frees the developer from
"NullPointer Exceptions" and "value error" exceptions that happens
when the code tries to sum a string and int in untyped languages. The
compiler notifies the developer that it happened not allowing the code
to run or go on production before it is solved.  


 - The type system avoids _value error exceptions_ and _null pointer
   exceptions_ avoiding unpleasant surprise at run-time. 

 - Maybe or Option type avoids null checking and Null pointer
   exceptions and raising exceptions for invalid data.

 - Either type is similar to Maybe, however it allows to report the
   failure or what is wrong with input.

 - Summarizing: The strong static typing system will help to avoid
   many hours of debugging trying to find where the null pointer
   exception or value error exception comes from, customer complaints
   and headaches.

See also: 

 - [[https://ro-che.info/articles/2015-05-02-smarter-validation][Smarter validation]]

 - [[http://fsharpforfunandprofit.com/posts/recipe-part2/][Railway oriented programming | F# for fun and profit]]

 - [[http://martinfowler.com/articles/replaceThrowWithNotification.html][Replacing Throwing Exceptions with Notification in Validations]]

 - [[http://softwareengineering.stackexchange.com/questions/150837/maybe-monad-vs-exceptions?noredirect=1&lq=1][language agnostic - Maybe monad vs exceptions - Software
   Engineering Stack Exchange]]

 - [[http://codemonkeyism.com/some-thoughts-on-error-handling/][Some Thoughts on Error Handling - @codemonkeyism]]

 - [[https://blogs.janestreet.com/making-something-out-of-nothing-or-why-none-is-better-than-nan-and-null/][Making something out of nothing (or, why None is better than NaN and NULL) :: Jane Street Tech Blogs]]

 - [[http://robotlolita.me/2013/12/08/a-monad-in-practicality-first-class-failures.html][A Monad in Practicality: First-Class Failures - Quils in Space]]

 - [[https://hackage.haskell.org/package/validation-0.5.3/docs/Data-Validation.html][Data.Validation]]

 - [[https://hackage.haskell.org/package/either-4.4.1.1/docs/Data-Either-Validation.html][Data.Either.Validation]]

** Avoiding Exceptions in Pure functions 
*** Overview 

For pure functions and functions that performs validation like
valideDateOfBirth the best way is to indicate that the function may
fail making it explicit on the type system using Maybe or Either
returning =Nothing= for Maybe type or =Left <error-type>= for Either
type.

