haskell/haskell_handling_exceptions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Exception Handling</title>
<!-- 2017-03-05 dom 08:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Caio Rodrigues" />
<link href='/theme/style.css' rel='stylesheet'>
<link href="/Functional-Programming/theme/style.css" rel="stylesheet">


</head>
<body>
<div id="content">
<h1 class="title">Exception Handling</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Exception Handling</a>
<ul>
<li><a href="#sec-1-1">1.1. Overview</a></li>
<li><a href="#sec-1-2">1.2. Avoiding Exceptions in Pure functions</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Overview</a></li>
<li><a href="#sec-1-2-2">1.2.2. Avoiding Exception in partial functions</a></li>
<li><a href="#sec-1-2-3">1.2.3. Avoid exception in data validation</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Catching Exceptions</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Overview</a></li>
<li><a href="#sec-1-3-2">1.3.2. Examples of Exceptions:</a></li>
<li><a href="#sec-1-3-3">1.3.3. Catching Exceptions with catch</a>
<ul>
<li><a href="#sec-1-3-3-1">1.3.3.1. Overview</a></li>
<li><a href="#sec-1-3-3-2">1.3.3.2. Catching all exceptions</a></li>
<li><a href="#sec-1-3-3-3">1.3.3.3. Narrowing Exceptions</a></li>
<li><a href="#sec-1-3-3-4">1.3.3.4. Narrowing IO Exceptions</a></li>
</ul>
</li>
<li><a href="#sec-1-3-4">1.3.4. Catching Exceptions with catchIOError</a></li>
<li><a href="#sec-1-3-5">1.3.5. Catching Exceptions using the function catches</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<lu> 
  <li><a href="/Functional-Programming/index.html">Index</a></li>
  <li><a href="https://github.com/caiorss/Functional-Programming">Repository</a></li>
</lu>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Exception Handling</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Exceptions are events that happens during run-time that disrupts the
normal flow of execution. The common sources of exceptions are
partial functions (functions not defined to all its domain),
user-thrown exceptions and IO. 
</p>

<p>
The Haskell static typing system by itself frees the developer from
"NullPointer Exceptions" and "value error" exceptions that happens
when the code tries to sum a string and int in untyped languages. The
compiler notifies the developer that it happened not allowing the code
to run or go on production before it is solved.  
</p>


<ul class="org-ul">
<li>The type system avoids <span class="underline">value error exceptions</span> and <span class="underline">null pointer
exceptions</span> avoiding unpleasant surprise at run-time. 
</li>

<li>Maybe or Option type avoids null checking and Null pointer
exceptions and raising exceptions for invalid data.
</li>

<li>Either type is similar to Maybe, however it allows to report the
failure or what is wrong with input.
</li>

<li>Summarizing: The strong static typing system will help to avoid
many hours of debugging trying to find where the null pointer
exception or value error exception comes from, customer complaints
and headaches.
</li>
</ul>

<p>
See also: 
</p>

<ul class="org-ul">
<li><a href="https://ro-che.info/articles/2015-05-02-smarter-validation">Smarter validation</a>
</li>

<li><a href="http://fsharpforfunandprofit.com/posts/recipe-part2/">Railway oriented programming | F# for fun and profit</a>
</li>

<li><a href="http://martinfowler.com/articles/replaceThrowWithNotification.html">Replacing Throwing Exceptions with Notification in Validations</a>
</li>

<li><a href="http://softwareengineering.stackexchange.com/questions/150837/maybe-monad-vs-exceptions?noredirect=1&lq=1">language agnostic - Maybe monad vs exceptions - Software
Engineering Stack Exchange</a>
</li>

<li><a href="http://codemonkeyism.com/some-thoughts-on-error-handling/">Some Thoughts on Error Handling - @codemonkeyism</a>
</li>

<li id="[[<a href="https://blogs.janestreet.com/making-something-out-of-nothing-or-why-none-is-better-than-nan-and-null/][Making">https://blogs.janestreet.com/making-something-out-of-nothing-or-why-none-is-better-than-nan-and-null/][Making</a> something out of nothing (or, why None is better than NaN and NULL)">Jane Street Tech Blogs]]
</li>

<li><a href="http://robotlolita.me/2013/12/08/a-monad-in-practicality-first-class-failures.html">A Monad in Practicality: First-Class Failures - Quils in Space</a>
</li>

<li><a href="https://hackage.haskell.org/package/validation-0.5.3/docs/Data-Validation.html">Data.Validation</a>
</li>

<li><a href="https://hackage.haskell.org/package/either-4.4.1.1/docs/Data-Either-Validation.html">Data.Either.Validation</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Avoiding Exceptions in Pure functions</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Overview</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
For pure functions and functions that performs validation like
valideDateOfBirth the best way is to indicate that the function may
fail making it explicit on the type system using Maybe or Either
returning <code>Nothing</code> for Maybe type or <code>Left &lt;error-type&gt;</code> for Either
type.
</p>
</div>
</div>
