haskell/haskell_handling_exceptions.org
*** Avoiding Exception in partial functions 

Examples of _partial functions_: 

#+BEGIN_SRC haskell 
  > head [10, 20, 30] 
  10
  it :: Num a => a
  >

  > head [] 
  ,*** Exception: Prelude.head: empty list
  >

  > div 100 0 
  ,*** Exception: divide by zero
  >
   
  > read "100" :: Int 
  100
  it :: Int
  > read "-100" :: Int 
  -100
  it :: Int
  > read "noise" :: Int 
  ,*** Exception: Prelude.read: no parse
  >   
#+END_SRC

Example: Avoiding exceptions using Maybe (Option type) or Either:

#+BEGIN_SRC haskell 

  :{
  headSafe :: [a] -> Maybe a
  headSafe []     = Nothing 
  headSafe (x:_)  = Just x
  :}

  > headSafe [1, 2, 3, 4, 5]
  Just 1
  it :: Num a => Maybe a
  > headSafe []
  Nothing
  it :: Maybe a
  > :t headSafe
  headSafe :: [a] -> Maybe a
  >

  :t div 
  > div :: Integral a => a -> a -> a
  >
    
  :{
  divSafe :: Integral a => a -> a -> Maybe a
  divSafe x 0 = Nothing
  divSafe x y = Just (div x y)
  :}

  > divSafe 100 20 
  Just 5
  it :: Integral a => Maybe a
  > divSafe 100 0 
  Nothing
  it :: Integral a => Maybe a
  >

  -- Use readMaybe instead of read 
  -- 
  > import Text.Read (readMaybe)
  >

  > readMaybe "Just 200" :: Maybe (Maybe Int)
  Just (Just 200)
  it :: Maybe (Maybe Int)
  > readMaybe "Nothing" :: Maybe (Maybe Int)
  Just Nothing
  it :: Maybe (Maybe Int)
  > readMaybe "Notasdasdas" :: Maybe (Maybe Int)
  Nothing
  it :: Maybe (Maybe Int)
  > 
    
  > readMaybe "[1, 2, 3, 4, 5]" :: Maybe [Int] 
  Just [1,2,3,4,5]
  it :: Maybe [Int]

  > readMaybe "garbage" :: Maybe [Int] 
  Nothing
  it :: Maybe [Int]
  > 

  > readMaybe "[100.0, 200.0, 300.0]" :: Maybe [Double] 
  Just [100.0,200.0,300.0]
  it :: Maybe [Double]
  > readMaybe ", 200.0, 300.0]" :: Maybe [Double] 
  Nothing
  it :: Maybe [Double]
  >   
    
#+END_SRC

