haskell/haskell_handling_exceptions.html

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Avoiding Exception in partial functions</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Examples of <span class="underline">partial functions</span>: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">head</span> [10, 20, 30] 
10
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> a
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">head</span> <span class="org-haskell-constructor">[]</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> Prelude.head<span class="org-haskell-type">:</span> empty list
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">div</span> 100 0 
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> divide by zero
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">read</span> <span class="org-string">"100"</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> 
100
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">read</span> <span class="org-string">"-100"</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> 
<span class="org-haskell-operator">-</span>100
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">read</span> <span class="org-string">"noise"</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> Prelude.read<span class="org-haskell-type">:</span> no parse
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Example: Avoiding exceptions using Maybe (Option type) or Either:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">headSafe</span> <span class="org-haskell-operator">::</span> [a] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> a
<span class="org-haskell-definition">headSafe</span> <span class="org-haskell-constructor">[]</span>     <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span> 
<span class="org-haskell-definition">headSafe</span> (x<span class="org-haskell-constructor">:</span><span class="org-haskell-keyword">_</span>)  <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> x
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">headSafe</span> [1, 2, 3, 4, 5]
<span class="org-haskell-constructor">Just</span> 1
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Maybe</span> a
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">headSafe</span> <span class="org-haskell-constructor">[]</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> a
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t headSafe
<span class="org-haskell-definition">headSafe</span> <span class="org-haskell-operator">::</span> [a] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> a
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-type">:</span>t div 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">div</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integral</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-type">:</span>{
<span class="org-haskell-definition">divSafe</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integral</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> a
<span class="org-haskell-definition">divSafe</span> x 0 <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-definition">divSafe</span> x y <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> (div x y)
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">divSafe</span> 100 20 
<span class="org-haskell-constructor">Just</span> 5
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integral</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Maybe</span> a
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">divSafe</span> 100 0 
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integral</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Maybe</span> a
<span class="org-haskell-operator">&gt;</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Use readMaybe instead of read </span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Read</span> (readMaybe)
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readMaybe</span> <span class="org-string">"Just 200"</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> (<span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Int</span>)
<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Just</span> 200)
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> (<span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Int</span>)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readMaybe</span> <span class="org-string">"Nothing"</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> (<span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Int</span>)
<span class="org-haskell-constructor">Just</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> (<span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Int</span>)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readMaybe</span> <span class="org-string">"Notasdasdas"</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> (<span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Int</span>)
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> (<span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Int</span>)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readMaybe</span> <span class="org-string">"[1, 2, 3, 4, 5]"</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> [<span class="org-haskell-type">Int</span>] 
<span class="org-haskell-constructor">Just</span> [1,2,3,4,5]
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> [<span class="org-haskell-type">Int</span>]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readMaybe</span> <span class="org-string">"garbage"</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> [<span class="org-haskell-type">Int</span>] 
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> [<span class="org-haskell-type">Int</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readMaybe</span> <span class="org-string">"[100.0, 200.0, 300.0]"</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> [<span class="org-haskell-type">Double</span>] 
<span class="org-haskell-constructor">Just</span> [100.0,200.0,300.0]
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> [<span class="org-haskell-type">Double</span>]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readMaybe</span> <span class="org-string">", 200.0, 300.0]"</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> [<span class="org-haskell-type">Double</span>] 
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> [<span class="org-haskell-type">Double</span>]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
