haskell/haskell_handling_exceptions.org
*** Avoid exception in data validation 

Example functions that performs data validation or user validation: 

For function that performs data validation it is better to return the
result as an Maybe or Either type instead of raise an Exception. Maybe
is better for functions that only have one possible failure or is not
necessary to know the type of failure. The Either type is useful to
report error, failure information or invalid data. 


#+BEGIN_SRC haskell 

  import Text.Read (readMabye)

  :{
  validateAge :: String -> Int  
  validateAge input =
    case readMaybe input of
      Nothing  -> error "Invalid age. Not a number"
      Just age -> case age of 
                  _ | age < 0    -> error "Error: Invalid age. It must be greater than zero."
                  _ | age <= 18  -> error "Error: Bellow legal age to sign the contract."
                  _ | age > 200  -> error "Error: Invalid age. Impossible age."
                  _              -> age   
  :}

  > validateAge "asdfa" 
  ,*** Exception: Invalid age. Not a number
  CallStack (from HasCallStack):
    error, called at <interactive>:1083:17 in interactive:Ghci54

  > validateAge "-100" 
  ,*** Exception: Error: Invalid age. It must be greater than zero.
  CallStack (from HasCallStack):
    error, called at <interactive>:1085:35 in interactive:Ghci54

  > validateAge "16" 
  ,*** Exception: Error: Bellow legal age to sign the contract.
  CallStack (from HasCallStack):
    error, called at <interactive>:1086:35 in interactive:Ghci54
  >
    
  > validateAge "300" 
  ,*** Exception: Error: Invalid age. Impossible age.
  CallStack (from HasCallStack):
    error, called at <interactive>:1087:35 in interactive:Ghci54
  >

  > validateAge "30" 
  30
  it :: Int

  > validateAge "20" 
  20
  it :: Int

  > validateAge "35"  
  35
  it :: Int
  >   
#+END_SRC


This function can be refactored to: 

#+BEGIN_SRC haskell 
  import Text.Read (readMabye)

  :{
  validateAge :: String -> Either String Int  
  validateAge input =
    case readMaybe input of
      Nothing  -> Left "Invalid input. Not a number"
      Just age -> case age of 
                  _ | age < 0    -> Left "Error: Invalid age. It must be greater than zero."
                  _ | age <= 18  -> Left "Error: Bellow legal age to sign the contract."
                  _ | age > 200  -> Left "Error: Invalid age. Impossible age."
                  _              -> Right age   
  :}

  > validateAge "-100"
  Left "Error: Invalid age. It must be greater than zero."
  it :: Either String Int
  > validateAge "16"
  Left "Error: Bellow legal age to sign the contract."
  it :: Either String Int
  > validateAge "300"
  Left "Error: Invalid age. Impossible age."
  it :: Either String Int
  > validateAge "400"
  Left "Error: Invalid age. Impossible age."
  it :: Either String Int
  > validateAge "20"
  Right 20
  it :: Either String Int
  > validateAge "19"
  Right 19
  it :: Either String Int
  >

  > mapM_ print $ map validateAge ["safsdf", "-100", "garbage", "400", "7", "15", "20", "25"]
  Left "Invalid input. Not a number"
  Left "Error: Invalid age. It must be greater than zero."
  Left "Invalid input. Not a number"
  Left "Error: Invalid age. Impossible age."
  Left "Error: Bellow legal age to sign the contract."
  Left "Error: Bellow legal age to sign the contract."
  Right 20
  Right 25
  it :: ()
  >


    
#+END_SRC

Algebraic data types are more friendly to pattern matching than
strings. So the code above could be refactored to: 

#+BEGIN_SRC haskell 
  import Text.Read (readMabye)

  :{ 
  data AgeError = AgeInvalidInput
                | AgeBellowLegalAge
                | AgeImpossible
                deriving (Eq, Show, Read)
  :}


  :{
  validateAge :: String -> Either AgeError Int  
  validateAge input =
    case readMaybe input of
      Nothing  -> Left AgeInvalidInput
      Just age -> case age of 
                  _ | age < 0    -> Left AgeImpossible
                  _ | age <= 18  -> Left AgeBellowLegalAge
                  _ | age > 200  -> Left AgeImpossible
                  _              -> Right age   
  :}

  > map (\input -> (input, validateAge input)) ["safsdf", "-100", "garbage", "400", "7", "15", "20", "25"]
  [("safsdf",Left AgeInvalidInput),("-100",Left AgeImpossible),("garbage",Left AgeInvalidInput),
   ("400",Left AgeImpossible),("7",Left AgeBellowLegalAge),
   ("15",Left AgeBellowLegalAge),("20",Right 20),
   ("25",Right 25)]
  it :: [([Char], Either AgeError Int)]
  > 
  > 

  > mapM_ print $ map validateAge ["safsdf", "-100", "garbage", "400", "7", "15", "20", "25"]
  Left AgeInvalidInput
  Left AgeImpossible
  Left AgeInvalidInput
  Left AgeImpossible
  Left AgeBellowLegalAge
  Left AgeBellowLegalAge
  Right 20
  Right 25
  it :: ()
  >

  :{
  showAgeError :: AgeError -> String
  showAgeError age =
     case age of
       AgeBellowLegalAge ->  "Error: Bellow legal age to sign the contract."
       AgeImpossible     ->  "Error: Invalid age. Impossible age."
       AgeInvalidInput    ->  "Invalid input. Not a number"
  :}

  > showAgeError AgeImpossible
  "Error: Invalid age. Impossible age."
  it :: String
  > showAgeError AgeInvalidInput
  "Invalid input. Not a number"
  it :: String
  > showAgeError AgeImpossible
  "Error: Invalid age. Impossible age."
  it :: String
  >

    
  :{
  mapLeft :: (e -> b) -> Either e a -> Either b a
  mapLeft fn value =
    case value of
      Right a -> Right a
      Left  e -> Left (fn e)
  :}

  > mapLeft showAgeError $ validateAge "20000" 
  Left "Error: Invalid age. Impossible age."
  it :: Either String Int
  > mapLeft showAgeError $ validateAge "-100" 
  Left "Error: Invalid age. Impossible age."
  it :: Either String Int
  > mapLeft showAgeError $ validateAge "10" 
  Left "Error: Bellow legal age to sign the contract."
  it :: Either String Int
  > mapLeft showAgeError $ validateAge "15" 
  Left "Error: Bellow legal age to sign the contract."
  it :: Either String Int
  > mapLeft showAgeError $ validateAge "25" 
  Right 25
  it :: Either String Int
  > mapLeft showAgeError $ validateAge "36" 
  Right 36
  it :: Either String Int
  >

#+END_SRC

Refactoring the function to validate multiple data: 

#+BEGIN_SRC haskell 


  import Text.Read (readMabye)

  :{ 
  data AgeError = AgeInvalidInput
                | AgeBellowLegalAge
                | AgeImpossible
                deriving (Eq, Show, Read)
  :}

  type UserData = (String, Int)


  :{
  data UserDataError = UserAgeError AgeError
                     | UserNameError
                     deriving(Eq, Show, Read)
  :}

  :{
  mapLeft :: (e -> b) -> Either e a -> Either b a
  mapLeft fn value =
    case value of
      Right a -> Right a
      Left  e -> Left (fn e)
  :}


  :{
  validateAge :: String -> Either UserDataError Int  
  validateAge input = mapLeft UserAgeError $ validateAgeAux input 
    where
      validateAgeAux input = 
        case readMaybe input of
          Nothing  -> Left AgeInvalidInput
          Just age -> case age of 
                      _ | age < 0    -> Left AgeImpossible
                      _ | age <= 18  -> Left AgeBellowLegalAge
                      _ | age > 200  -> Left AgeImpossible
                      _              -> Right age   
  :}


  :{
  validateName :: String -> Either UserDataError String   
  validateName name =
    case name of
      "" -> Left $ UserNameError
      _  -> Right name
  :}

  :{
  validateUser :: String -> String -> Either UserDataError UserData
  validateUser name age = do
    userName <- validateName name
    userAge  <- validateAge age
    return (userName, userAge)
  :}


  -- Testing: 
  --------------------

  > validateAge "-200" 
  Left (UserAgeError AgeImpossible)
  it :: Either UserDataError Int
  > validateAge "1000" 
  Left (UserAgeError AgeImpossible)
  it :: Either UserDataError Int
  > validateAge "30" 
  Right 30
  it :: Either UserDataError Int
  > validateAge "25" 
  Right 25
  it :: Either UserDataError Int
  > validateAge "16" 
  Left (UserAgeError AgeBellowLegalAge)
  it :: Either UserDataError Int

  > validateAge "25" 
  Right 25
  it :: Either UserDataError Int
  >

  > validateName "" 
  Left UserNameError
  it :: Either UserDataError String
  > 
  > validateName "John" 
  Right "John"
  it :: Either UserDataError String
  >

  > validateUser "John" "300" 
  Left (UserAgeError AgeImpossible)
  it :: Either UserDataError UserData
  > validateUser "John" "15" 
  Left (UserAgeError AgeBellowLegalAge)
  it :: Either UserDataError UserData
  > validateUser "John" "-100" 
  Left (UserAgeError AgeImpossible)
  it :: Either UserDataError UserData
  > validateUser "" "-100" 
  Left UserNameError
  it :: Either UserDataError UserData
  >

  > validateUser "John" "20" 
  Right ("John",20)
  it :: Either UserDataError UserData
  >   
#+END_SRC

