haskell/haskell_handling_exceptions.html

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Avoid exception in data validation</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Example functions that performs data validation or user validation: 
</p>

<p>
For function that performs data validation it is better to return the
result as an Maybe or Either type instead of raise an Exception. Maybe
is better for functions that only have one possible failure or is not
necessary to know the type of failure. The Either type is useful to
report error, failure information or invalid data. 
</p>


<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Read</span> (readMabye)

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">validateAge</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span>  
<span class="org-haskell-definition">validateAge</span> input <span class="org-haskell-operator">=</span>
  <span class="org-haskell-keyword">case</span> readMaybe input <span class="org-haskell-keyword">of</span>
    <span class="org-haskell-constructor">Nothing</span>  <span class="org-haskell-operator">-&gt;</span> error <span class="org-string">"Invalid age. Not a number"</span>
    <span class="org-haskell-constructor">Just</span> age <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">case</span> age <span class="org-haskell-keyword">of</span> 
                <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> age <span class="org-haskell-operator">&lt;</span> 0    <span class="org-haskell-operator">-&gt;</span> error <span class="org-string">"Error: Invalid age. It must be greater than zero."</span>
                <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> age <span class="org-haskell-operator">&lt;=</span> 18  <span class="org-haskell-operator">-&gt;</span> error <span class="org-string">"Error: Bellow legal age to sign the contract."</span>
                <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> age <span class="org-haskell-operator">&gt;</span> 200  <span class="org-haskell-operator">-&gt;</span> error <span class="org-string">"Error: Invalid age. Impossible age."</span>
                <span class="org-haskell-keyword">_</span>              <span class="org-haskell-operator">-&gt;</span> age   
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"asdfa"</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">Invalid</span> age<span class="org-haskell-operator">.</span> <span class="org-haskell-constructor">Not</span> a number
<span class="org-haskell-constructor">CallStack</span> (from <span class="org-haskell-constructor">HasCallStack</span>)<span class="org-haskell-constructor">:</span>
  error, called at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>1083<span class="org-haskell-constructor">:</span>17 <span class="org-haskell-keyword">in</span> interactive<span class="org-haskell-constructor">:Ghci54</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"-100"</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">Error:</span> <span class="org-haskell-constructor">Invalid</span> age<span class="org-haskell-operator">.</span> <span class="org-haskell-constructor">It</span> must be greater than zero<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">CallStack</span> (from <span class="org-haskell-constructor">HasCallStack</span>)<span class="org-haskell-constructor">:</span>
  error, called at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>1085<span class="org-haskell-constructor">:</span>35 <span class="org-haskell-keyword">in</span> interactive<span class="org-haskell-constructor">:Ghci54</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"16"</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">Error:</span> <span class="org-haskell-constructor">Bellow</span> legal age to sign the contract<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">CallStack</span> (from <span class="org-haskell-constructor">HasCallStack</span>)<span class="org-haskell-constructor">:</span>
  error, called at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>1086<span class="org-haskell-constructor">:</span>35 <span class="org-haskell-keyword">in</span> interactive<span class="org-haskell-constructor">:Ghci54</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"300"</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">Error:</span> <span class="org-haskell-constructor">Invalid</span> age<span class="org-haskell-operator">.</span> <span class="org-haskell-constructor">Impossible</span> age<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">CallStack</span> (from <span class="org-haskell-constructor">HasCallStack</span>)<span class="org-haskell-constructor">:</span>
  error, called at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>1087<span class="org-haskell-constructor">:</span>35 <span class="org-haskell-keyword">in</span> interactive<span class="org-haskell-constructor">:Ghci54</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"30"</span> 
30
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"20"</span> 
20
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"35"</span>  
35
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>


<p>
This function can be refactored to: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Read</span> (readMabye)

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">validateAge</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">String</span> <span class="org-haskell-type">Int</span>  
<span class="org-haskell-definition">validateAge</span> input <span class="org-haskell-operator">=</span>
  <span class="org-haskell-keyword">case</span> readMaybe input <span class="org-haskell-keyword">of</span>
    <span class="org-haskell-constructor">Nothing</span>  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> <span class="org-string">"Invalid input. Not a number"</span>
    <span class="org-haskell-constructor">Just</span> age <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">case</span> age <span class="org-haskell-keyword">of</span> 
                <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> age <span class="org-haskell-operator">&lt;</span> 0    <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Invalid age. It must be greater than zero."</span>
                <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> age <span class="org-haskell-operator">&lt;=</span> 18  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Bellow legal age to sign the contract."</span>
                <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> age <span class="org-haskell-operator">&gt;</span> 200  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Invalid age. Impossible age."</span>
                <span class="org-haskell-keyword">_</span>              <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Right</span> age   
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"-100"</span>
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Invalid age. It must be greater than zero."</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">String</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"16"</span>
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Bellow legal age to sign the contract."</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">String</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"300"</span>
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Invalid age. Impossible age."</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">String</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"400"</span>
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Invalid age. Impossible age."</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">String</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"20"</span>
<span class="org-haskell-constructor">Right</span> 20
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">String</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"19"</span>
<span class="org-haskell-constructor">Right</span> 19
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">String</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM_</span> print <span class="org-haskell-operator">$</span> map validateAge [<span class="org-string">"safsdf"</span>, <span class="org-string">"-100"</span>, <span class="org-string">"garbage"</span>, <span class="org-string">"400"</span>, <span class="org-string">"7"</span>, <span class="org-string">"15"</span>, <span class="org-string">"20"</span>, <span class="org-string">"25"</span>]
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Invalid input. Not a number"</span>
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Invalid age. It must be greater than zero."</span>
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Invalid input. Not a number"</span>
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Invalid age. Impossible age."</span>
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Bellow legal age to sign the contract."</span>
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Bellow legal age to sign the contract."</span>
<span class="org-haskell-constructor">Right</span> 20
<span class="org-haskell-constructor">Right</span> 25
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Algebraic data types are more friendly to pattern matching than
strings. So the code above could be refactored to: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Read</span> (readMabye)

<span class="org-haskell-constructor">:</span>{ 
<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">AgeError</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">AgeInvalidInput</span>
              <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">AgeBellowLegalAge</span>
              <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">AgeImpossible</span>
              <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Show</span>, <span class="org-haskell-constructor">Read</span>)
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">validateAge</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">AgeError</span> <span class="org-haskell-type">Int</span>  
<span class="org-haskell-definition">validateAge</span> input <span class="org-haskell-operator">=</span>
  <span class="org-haskell-keyword">case</span> readMaybe input <span class="org-haskell-keyword">of</span>
    <span class="org-haskell-constructor">Nothing</span>  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeInvalidInput</span>
    <span class="org-haskell-constructor">Just</span> age <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">case</span> age <span class="org-haskell-keyword">of</span> 
                <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> age <span class="org-haskell-operator">&lt;</span> 0    <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeImpossible</span>
                <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> age <span class="org-haskell-operator">&lt;=</span> 18  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeBellowLegalAge</span>
                <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> age <span class="org-haskell-operator">&gt;</span> 200  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeImpossible</span>
                <span class="org-haskell-keyword">_</span>              <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Right</span> age   
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-operator">\</span>input <span class="org-haskell-operator">-&gt;</span> (input, validateAge input)) [<span class="org-string">"safsdf"</span>, <span class="org-string">"-100"</span>, <span class="org-string">"garbage"</span>, <span class="org-string">"400"</span>, <span class="org-string">"7"</span>, <span class="org-string">"15"</span>, <span class="org-string">"20"</span>, <span class="org-string">"25"</span>]
[(<span class="org-string">"safsdf"</span>,<span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeInvalidInput</span>),(<span class="org-string">"-100"</span>,<span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeImpossible</span>),(<span class="org-string">"garbage"</span>,<span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeInvalidInput</span>),
 (<span class="org-string">"400"</span>,<span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeImpossible</span>),(<span class="org-string">"7"</span>,<span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeBellowLegalAge</span>),
 (<span class="org-string">"15"</span>,<span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeBellowLegalAge</span>),(<span class="org-string">"20"</span>,<span class="org-haskell-constructor">Right</span> 20),
 (<span class="org-string">"25"</span>,<span class="org-haskell-constructor">Right</span> 25)]
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> [([<span class="org-haskell-type">Char</span>], <span class="org-haskell-type">Either</span> <span class="org-haskell-type">AgeError</span> <span class="org-haskell-type">Int</span>)]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM_</span> print <span class="org-haskell-operator">$</span> map validateAge [<span class="org-string">"safsdf"</span>, <span class="org-string">"-100"</span>, <span class="org-string">"garbage"</span>, <span class="org-string">"400"</span>, <span class="org-string">"7"</span>, <span class="org-string">"15"</span>, <span class="org-string">"20"</span>, <span class="org-string">"25"</span>]
<span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeInvalidInput</span>
<span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeImpossible</span>
<span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeInvalidInput</span>
<span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeImpossible</span>
<span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeBellowLegalAge</span>
<span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeBellowLegalAge</span>
<span class="org-haskell-constructor">Right</span> 20
<span class="org-haskell-constructor">Right</span> 25
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-type">:</span>{
<span class="org-haskell-definition">showAgeError</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">AgeError</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-definition">showAgeError</span> age <span class="org-haskell-operator">=</span>
   <span class="org-haskell-keyword">case</span> age <span class="org-haskell-keyword">of</span>
     <span class="org-haskell-constructor">AgeBellowLegalAge</span> <span class="org-haskell-operator">-&gt;</span>  <span class="org-string">"Error: Bellow legal age to sign the contract."</span>
     <span class="org-haskell-constructor">AgeImpossible</span>     <span class="org-haskell-operator">-&gt;</span>  <span class="org-string">"Error: Invalid age. Impossible age."</span>
     <span class="org-haskell-constructor">AgeInvalidInput</span>    <span class="org-haskell-operator">-&gt;</span>  <span class="org-string">"Invalid input. Not a number"</span>
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">showAgeError</span> <span class="org-haskell-constructor">AgeImpossible</span>
<span class="org-string">"Error: Invalid age. Impossible age."</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">showAgeError</span> <span class="org-haskell-type">AgeInvalidInput</span>
<span class="org-string">"Invalid input. Not a number"</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">showAgeError</span> <span class="org-haskell-type">AgeImpossible</span>
<span class="org-string">"Error: Invalid age. Impossible age."</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span>


<span class="org-haskell-type">:</span>{
<span class="org-haskell-definition">mapLeft</span> <span class="org-haskell-operator">::</span> (e <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Either</span> e a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Either</span> b a
<span class="org-haskell-definition">mapLeft</span> fn value <span class="org-haskell-operator">=</span>
  <span class="org-haskell-keyword">case</span> value <span class="org-haskell-keyword">of</span>
    <span class="org-haskell-constructor">Right</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Right</span> a
    <span class="org-haskell-constructor">Left</span>  e <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> (fn e)
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapLeft</span> showAgeError <span class="org-haskell-operator">$</span> validateAge <span class="org-string">"20000"</span> 
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Invalid age. Impossible age."</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">String</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapLeft</span> showAgeError <span class="org-haskell-operator">$</span> validateAge <span class="org-string">"-100"</span> 
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Invalid age. Impossible age."</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">String</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapLeft</span> showAgeError <span class="org-haskell-operator">$</span> validateAge <span class="org-string">"10"</span> 
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Bellow legal age to sign the contract."</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">String</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapLeft</span> showAgeError <span class="org-haskell-operator">$</span> validateAge <span class="org-string">"15"</span> 
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: Bellow legal age to sign the contract."</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">String</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapLeft</span> showAgeError <span class="org-haskell-operator">$</span> validateAge <span class="org-string">"25"</span> 
<span class="org-haskell-constructor">Right</span> 25
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">String</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapLeft</span> showAgeError <span class="org-haskell-operator">$</span> validateAge <span class="org-string">"36"</span> 
<span class="org-haskell-constructor">Right</span> 36
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">String</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Refactoring the function to validate multiple data: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Read</span> (readMabye)

<span class="org-haskell-constructor">:</span>{ 
<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">AgeError</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">AgeInvalidInput</span>
              <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">AgeBellowLegalAge</span>
              <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">AgeImpossible</span>
              <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Show</span>, <span class="org-haskell-constructor">Read</span>)
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-keyword">type</span> <span class="org-haskell-type">UserData</span> <span class="org-haskell-operator">=</span> (<span class="org-haskell-type">String</span>, <span class="org-haskell-type">Int</span>)


<span class="org-haskell-type">:</span>{
<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">UserAgeError</span> <span class="org-haskell-constructor">AgeError</span>
                   <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">UserNameError</span>
                   <span class="org-haskell-keyword">deriving</span>(<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Show</span>, <span class="org-haskell-constructor">Read</span>)
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">mapLeft</span> <span class="org-haskell-operator">::</span> (e <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Either</span> e a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Either</span> b a
<span class="org-haskell-definition">mapLeft</span> fn value <span class="org-haskell-operator">=</span>
  <span class="org-haskell-keyword">case</span> value <span class="org-haskell-keyword">of</span>
    <span class="org-haskell-constructor">Right</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Right</span> a
    <span class="org-haskell-constructor">Left</span>  e <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> (fn e)
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">validateAge</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">Int</span>  
<span class="org-haskell-definition">validateAge</span> input <span class="org-haskell-operator">=</span> mapLeft <span class="org-haskell-constructor">UserAgeError</span> <span class="org-haskell-operator">$</span> validateAgeAux input 
  <span class="org-haskell-keyword">where</span>
    validateAgeAux input <span class="org-haskell-operator">=</span> 
      <span class="org-haskell-keyword">case</span> readMaybe input <span class="org-haskell-keyword">of</span>
        <span class="org-haskell-constructor">Nothing</span>  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeInvalidInput</span>
        <span class="org-haskell-constructor">Just</span> age <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">case</span> age <span class="org-haskell-keyword">of</span> 
                    <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> age <span class="org-haskell-operator">&lt;</span> 0    <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeImpossible</span>
                    <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> age <span class="org-haskell-operator">&lt;=</span> 18  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeBellowLegalAge</span>
                    <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> age <span class="org-haskell-operator">&gt;</span> 200  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">AgeImpossible</span>
                    <span class="org-haskell-keyword">_</span>              <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Right</span> age   
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">validateName</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">String</span>   
<span class="org-haskell-definition">validateName</span> name <span class="org-haskell-operator">=</span>
  <span class="org-haskell-keyword">case</span> name <span class="org-haskell-keyword">of</span>
    <span class="org-string">""</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Left</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">UserNameError</span>
    <span class="org-haskell-keyword">_</span>  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Right</span> name
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">validateUser</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">UserData</span>
<span class="org-haskell-definition">validateUser</span> name age <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  userName <span class="org-haskell-operator">&lt;-</span> validateName name
  userAge  <span class="org-haskell-operator">&lt;-</span> validateAge age
  return (userName, userAge)
<span class="org-haskell-constructor">:</span>}


<span class="org-comment-delimiter">-- </span><span class="org-comment">Testing: </span>
<span class="org-comment-delimiter">--</span><span class="org-comment">------------------</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"-200"</span> 
<span class="org-haskell-constructor">Left</span> (<span class="org-haskell-constructor">UserAgeError</span> <span class="org-haskell-constructor">AgeImpossible</span>)
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"1000"</span> 
<span class="org-haskell-constructor">Left</span> (<span class="org-haskell-constructor">UserAgeError</span> <span class="org-haskell-constructor">AgeImpossible</span>)
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"30"</span> 
<span class="org-haskell-constructor">Right</span> 30
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"25"</span> 
<span class="org-haskell-constructor">Right</span> 25
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"16"</span> 
<span class="org-haskell-constructor">Left</span> (<span class="org-haskell-constructor">UserAgeError</span> <span class="org-haskell-constructor">AgeBellowLegalAge</span>)
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">Int</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateAge</span> <span class="org-string">"25"</span> 
<span class="org-haskell-constructor">Right</span> 25
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateName</span> <span class="org-string">""</span> 
<span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">UserNameError</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateName</span> <span class="org-string">"John"</span> 
<span class="org-haskell-constructor">Right</span> <span class="org-string">"John"</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateUser</span> <span class="org-string">"John"</span> <span class="org-string">"300"</span> 
<span class="org-haskell-constructor">Left</span> (<span class="org-haskell-constructor">UserAgeError</span> <span class="org-haskell-constructor">AgeImpossible</span>)
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">UserData</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateUser</span> <span class="org-string">"John"</span> <span class="org-string">"15"</span> 
<span class="org-haskell-constructor">Left</span> (<span class="org-haskell-constructor">UserAgeError</span> <span class="org-haskell-constructor">AgeBellowLegalAge</span>)
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">UserData</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateUser</span> <span class="org-string">"John"</span> <span class="org-string">"-100"</span> 
<span class="org-haskell-constructor">Left</span> (<span class="org-haskell-constructor">UserAgeError</span> <span class="org-haskell-constructor">AgeImpossible</span>)
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">UserData</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateUser</span> <span class="org-string">""</span> <span class="org-string">"-100"</span> 
<span class="org-haskell-constructor">Left</span> <span class="org-haskell-constructor">UserNameError</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">UserData</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">validateUser</span> <span class="org-string">"John"</span> <span class="org-string">"20"</span> 
<span class="org-haskell-constructor">Right</span> (<span class="org-string">"John"</span>,20)
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">UserDataError</span> <span class="org-haskell-type">UserData</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
</div>
