haskell/haskell_handling_exceptions.org
*** Overview 

The haskell modules [[https://hackage.haskell.org/package/base-4.9.0.0/docs/Control-Exception.html][Control.Exception]] and [[https://hackage.haskell.org/package/base-4.9.0.0/docs/System-IO-Error.html#t:IOError][System.IO.Error]] provides
functions and type constructors to deal with exceptions. 

Exceptions can only be caught inside IO Monad. 


| Function             |    | Signature                                  | Summary / Short Description.                                    |
|----------------------+----+--------------------------------------------+-----------------------------------------------------------------|
|                      |    |                                            |                                                                 |
| [[https://hackage.haskell.org/package/base-4.9.0.0/docs/Control-Exception.html][*Control.Exception*]]  |    |                                            |                                                                 |
|                      |    |                                            |                                                                 |
| throw                | :: | Exception e => e -> a                      | Throw an exception.                                             |
| throwIO              | :: | Exception e => e -> IO a                   | A variant of throw that can only be used within the IO monad.   |
| catch                | :: | Exception e => IO a -> (e -> IO a) -> IO a | Catch exceptions.                                               |
| try                  | :: | Exception e => IO a -> IO (Either e a)     | Similar to catch, but returns an Either.                        |
| handle               | :: | Exception e => (e -> IO a) -> IO a -> IO a | A version of catch with the arguments swapped around.           |
| finally              |    |                                            |                                                                 |
| evaluate             |    |                                            |                                                                 |
|                      |    |                                            |                                                                 |
| [[https://hackage.haskell.org/package/base-4.9.0.0/docs/System-IO-Error.html][*System.IO.Error*]]    |    |                                            |                                                                 |
|----------------------+----+--------------------------------------------+-----------------------------------------------------------------|
|                      |    |                                            |                                                                 |
| ioError              | :: | IOError -> IO a                            | Raise an IOError in the IO monad.                               |
| catchIOError         | :: | IO a -> (IOError -> IO a) -> IO a          | Like the fuction catch, however catchs only IO exceptions.      |
| tryIOError           | :: | IO a -> IO (Either IOError a)              | Like the function try, however only aplicable to IO exceptions. |
| userError            | :: | String -> IOError                          | Construct an IOError value with a string describing the error.  |
|                      |    |                                            |                                                                 |
| isAlreadyExistsError | :: | IOError -> Bool                            |                                                                 |
| isDoesNotExistError  | :: | IOError -> Bool                            |                                                                 |
| isAlreadyInUseError  | :: | IOError -> Bool                            |                                                                 |
| isFullError          | :: | IOError -> Bool                            |                                                                 |
| isEOFError           | :: | IOError -> Bool                            |                                                                 |
| isIllegalOperation   | :: | IOError -> Bool                            |                                                                 |
| isPermissionError    | :: | IOError -> Bool                            |                                                                 |
| isUserError          | :: | IOError -> Bool                            |                                                                 |

*System.IO.Error predicates*

Notes: 

 - There are no predicate functions for all IO exception types. 

 - The exception type constructor are not exposed, so the only way to
   get the type of io exception is by using the predicates functions
   available at module [[https://hackage.haskell.org/package/base-4.9.0.0/docs/System-IO-Error.html][System.IO.Error]].


See module: [[https://hackage.haskell.org/package/base-4.9.0.0/docs/System-IO-Error.html][System.IO.Error]] for more details.

| Exception type         | Predicate            | Exception message                         | Cause:                                            |
| (abstract)             |                      | or exception string                       |                                                   |
|------------------------+----------------------+-------------------------------------------+---------------------------------------------------|
| AlreadyExists          | isAlreadyExistsError | already exists                            | File or directory already exists.                 |
|                        |                      |                                           |                                                   |
| NoSuchThing            | isDoesNotExistError  | does not exist                            | File, directory or enviroment variable            |
|                        |                      |                                           | doesn't exists.                                   |
|                        |                      |                                           |                                                   |
| ResourceBusy           | ?                    | resource busy                             |                                                   |
|                        |                      |                                           |                                                   |
| ResourceExhausted      | ?                    | resource exhausted                        | Insufficient resources are available              |
|                        |                      |                                           | to perform the operation.                         |
|                        |                      |                                           |                                                   |
| EOF                    | isEOFError           | end of file                               | Reached end of file while trying to read          |
|                        |                      |                                           | some line or character.                           |
|                        |                      |                                           |                                                   |
| IllegalOperation       | isIllegalOperation   | illegal operation                         | The implementation does not support system calls. |
|                        |                      |                                           |                                                   |
| PermissionDenied       | isPermissionError    | permission denied                         | The process has insufficient privileges to        |
|                        |                      |                                           | perform the operation.                            |
|                        |                      |                                           |                                                   |
| UserError              | isUserError          | user error                                | Exception thrown by user.                         |
|                        |                      |                                           |                                                   |
| HardwareFault          | ?                    | hardware fault                            |                                                   |
|                        |                      |                                           |                                                   |
| InappropriateType      | ?                    | inappropriate type                        |                                                   |
|                        |                      |                                           |                                                   |
| Interrupted            | ?                    | interrupted                               |                                                   |
|                        |                      |                                           |                                                   |
| InvalidArgument        | ?                    | invalid argument                          |                                                   |
|                        |                      |                                           |                                                   |
| OtherError             | ?                    | failed                                    |                                                   |
|                        |                      |                                           |                                                   |
| ProtocolError          | ?                    | protocol error                            |                                                   |
|                        |                      |                                           |                                                   |
| ResourceVanished       | ?                    | resource vanished                         |                                                   |
|                        |                      |                                           |                                                   |
| SystemError            | ?                    | system error                              |                                                   |
|                        |                      |                                           |                                                   |
| TimeExpired            | ?                    | timeout                                   |                                                   |
|                        |                      |                                           |                                                   |
| UnsatisfiedConstraints | ?                    | unsatisfied constraints -- ultra-precise! |                                                   |
|                        |                      |                                           |                                                   |
| UnsupportedOperation   | ?                    | unsupported operation                     |                                                   |

Arithmetic Exceptions: (Module: [[https://hackage.haskell.org/package/base-4.9.0.0/docs/Control-Exception.html][Control.Exception]])

| Type Constructor     | Exception Message          |
|----------------------+----------------------------|
| Overflow             | arithmetic overflow        |
| Underflow            | arithmetic underflow       |
| LossOfPrecision      | loss of precision          |
| DivideByZero         | divide by zero             |
| Denormal             | denormal                   |
| RatioZeroDenominator | Ratio has zero denominator |


*Exception Hierarchy:*

Exception

 - SomeException - Root of all exceptions 
   - IOError / IOException  
   - AsyncException
     - StackOverflow
     - HeapOverflow
     - ThreadKilled
     - ThreadKilled
   - ArithException
     - Overflow
     - Underflow
     - LossOfPrecision
     - DivideByZeror
     - Denormal
     - RatioZeroDenominator
   - ArrayException
   - AssertionFailed


See also: 

 - [[https://www.schoolofhaskell.com/user/commercial/content/exceptions-best-practices][Exceptions Best Practices - School of Haskell | School of Haskell]]

 - [[https://www.schoolofhaskell.com/user/snoyberg/general-haskell/exceptions/catching-all-exceptions][Catching all exceptions - School of Haskell | School of Haskell]]

 - [[https://en.wikibooks.org/wiki/Haskell/Libraries/IO][Haskell/Libraries/IO - Wikibooks, open books for an open world]]

 - [[http://blog.ezyang.com/2011/08/8-ways-to-report-errors-in-haskell-revisited/][8 ways to report errors in Haskell revisited : Inside 736-131]] 

 - [[http://www.randomhacks.net/2007/03/10/haskell-8-ways-to-report-errors/][8 ways to report errors in Haskell | Random Hacks]]

 - [[https://wiki.haskell.org/Exception][Exception - HaskellWiki]]

 - [[http://drunkcoding.tumblr.com/post/692076953/catching-exceptions-in-haskell][Coding like a drunk - Catching Exceptions in Haskell]]


Papers:

 - Marlow, S. - *An Extensible Dynamically-Typed Hierarchy of
   Exceptions*. Available at
   <http://community.haskell.org/~simonmar/papers/ext-exceptions.pdf>

