haskell/haskell_handling_exceptions.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Catching Exceptions</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Overview</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
The haskell modules <a href="https://hackage.haskell.org/package/base-4.9.0.0/docs/Control-Exception.html">Control.Exception</a> and <a href="https://hackage.haskell.org/package/base-4.9.0.0/docs/System-IO-Error.html#t:IOError">System.IO.Error</a> provides
functions and type constructors to deal with exceptions. 
</p>

<p>
Exceptions can only be caught inside IO Monad. 
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Function</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Signature</th>
<th scope="col" class="left">Summary / Short Description.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="https://hackage.haskell.org/package/base-4.9.0.0/docs/Control-Exception.html"><b>Control.Exception</b></a></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">throw</td>
<td class="left">::</td>
<td class="left">Exception e =&gt; e -&gt; a</td>
<td class="left">Throw an exception.</td>
</tr>

<tr>
<td class="left">throwIO</td>
<td class="left">::</td>
<td class="left">Exception e =&gt; e -&gt; IO a</td>
<td class="left">A variant of throw that can only be used within the IO monad.</td>
</tr>

<tr>
<td class="left">catch</td>
<td class="left">::</td>
<td class="left">Exception e =&gt; IO a -&gt; (e -&gt; IO a) -&gt; IO a</td>
<td class="left">Catch exceptions.</td>
</tr>

<tr>
<td class="left">try</td>
<td class="left">::</td>
<td class="left">Exception e =&gt; IO a -&gt; IO (Either e a)</td>
<td class="left">Similar to catch, but returns an Either.</td>
</tr>

<tr>
<td class="left">handle</td>
<td class="left">::</td>
<td class="left">Exception e =&gt; (e -&gt; IO a) -&gt; IO a -&gt; IO a</td>
<td class="left">A version of catch with the arguments swapped around.</td>
</tr>

<tr>
<td class="left">finally</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">evaluate</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="https://hackage.haskell.org/package/base-4.9.0.0/docs/System-IO-Error.html"><b>System.IO.Error</b></a></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ioError</td>
<td class="left">::</td>
<td class="left">IOError -&gt; IO a</td>
<td class="left">Raise an IOError in the IO monad.</td>
</tr>

<tr>
<td class="left">catchIOError</td>
<td class="left">::</td>
<td class="left">IO a -&gt; (IOError -&gt; IO a) -&gt; IO a</td>
<td class="left">Like the fuction catch, however catchs only IO exceptions.</td>
</tr>

<tr>
<td class="left">tryIOError</td>
<td class="left">::</td>
<td class="left">IO a -&gt; IO (Either IOError a)</td>
<td class="left">Like the function try, however only aplicable to IO exceptions.</td>
</tr>

<tr>
<td class="left">userError</td>
<td class="left">::</td>
<td class="left">String -&gt; IOError</td>
<td class="left">Construct an IOError value with a string describing the error.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">isAlreadyExistsError</td>
<td class="left">::</td>
<td class="left">IOError -&gt; Bool</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">isDoesNotExistError</td>
<td class="left">::</td>
<td class="left">IOError -&gt; Bool</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">isAlreadyInUseError</td>
<td class="left">::</td>
<td class="left">IOError -&gt; Bool</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">isFullError</td>
<td class="left">::</td>
<td class="left">IOError -&gt; Bool</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">isEOFError</td>
<td class="left">::</td>
<td class="left">IOError -&gt; Bool</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">isIllegalOperation</td>
<td class="left">::</td>
<td class="left">IOError -&gt; Bool</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">isPermissionError</td>
<td class="left">::</td>
<td class="left">IOError -&gt; Bool</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">isUserError</td>
<td class="left">::</td>
<td class="left">IOError -&gt; Bool</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
<b>System.IO.Error predicates</b>
</p>

<p>
Notes: 
</p>

<ul class="org-ul">
<li>There are no predicate functions for all IO exception types. 
</li>

<li>The exception type constructor are not exposed, so the only way to
get the type of io exception is by using the predicates functions
available at module <a href="https://hackage.haskell.org/package/base-4.9.0.0/docs/System-IO-Error.html">System.IO.Error</a>.
</li>
</ul>


<p>
See module: <a href="https://hackage.haskell.org/package/base-4.9.0.0/docs/System-IO-Error.html">System.IO.Error</a> for more details.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Exception type</th>
<th scope="col" class="left">Predicate</th>
<th scope="col" class="left">Exception message</th>
<th scope="col" class="left">Cause:</th>
</tr>

<tr>
<th scope="col" class="left">(abstract)</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">or exception string</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">AlreadyExists</td>
<td class="left">isAlreadyExistsError</td>
<td class="left">already exists</td>
<td class="left">File or directory already exists.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">NoSuchThing</td>
<td class="left">isDoesNotExistError</td>
<td class="left">does not exist</td>
<td class="left">File, directory or enviroment variable</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">doesn't exists.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ResourceBusy</td>
<td class="left">?</td>
<td class="left">resource busy</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ResourceExhausted</td>
<td class="left">?</td>
<td class="left">resource exhausted</td>
<td class="left">Insufficient resources are available</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">to perform the operation.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">EOF</td>
<td class="left">isEOFError</td>
<td class="left">end of file</td>
<td class="left">Reached end of file while trying to read</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">some line or character.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">IllegalOperation</td>
<td class="left">isIllegalOperation</td>
<td class="left">illegal operation</td>
<td class="left">The implementation does not support system calls.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">PermissionDenied</td>
<td class="left">isPermissionError</td>
<td class="left">permission denied</td>
<td class="left">The process has insufficient privileges to</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">perform the operation.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">UserError</td>
<td class="left">isUserError</td>
<td class="left">user error</td>
<td class="left">Exception thrown by user.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">HardwareFault</td>
<td class="left">?</td>
<td class="left">hardware fault</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">InappropriateType</td>
<td class="left">?</td>
<td class="left">inappropriate type</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Interrupted</td>
<td class="left">?</td>
<td class="left">interrupted</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">InvalidArgument</td>
<td class="left">?</td>
<td class="left">invalid argument</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">OtherError</td>
<td class="left">?</td>
<td class="left">failed</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ProtocolError</td>
<td class="left">?</td>
<td class="left">protocol error</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ResourceVanished</td>
<td class="left">?</td>
<td class="left">resource vanished</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">SystemError</td>
<td class="left">?</td>
<td class="left">system error</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">TimeExpired</td>
<td class="left">?</td>
<td class="left">timeout</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">UnsatisfiedConstraints</td>
<td class="left">?</td>
<td class="left">unsatisfied constraints &#x2013; ultra-precise!</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">UnsupportedOperation</td>
<td class="left">?</td>
<td class="left">unsupported operation</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Arithmetic Exceptions: (Module: <a href="https://hackage.haskell.org/package/base-4.9.0.0/docs/Control-Exception.html">Control.Exception</a>)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Type Constructor</th>
<th scope="col" class="left">Exception Message</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Overflow</td>
<td class="left">arithmetic overflow</td>
</tr>

<tr>
<td class="left">Underflow</td>
<td class="left">arithmetic underflow</td>
</tr>

<tr>
<td class="left">LossOfPrecision</td>
<td class="left">loss of precision</td>
</tr>

<tr>
<td class="left">DivideByZero</td>
<td class="left">divide by zero</td>
</tr>

<tr>
<td class="left">Denormal</td>
<td class="left">denormal</td>
</tr>

<tr>
<td class="left">RatioZeroDenominator</td>
<td class="left">Ratio has zero denominator</td>
</tr>
</tbody>
</table>


<p>
<b>Exception Hierarchy:</b>
</p>

<p>
Exception
</p>

<ul class="org-ul">
<li>SomeException - Root of all exceptions 
<ul class="org-ul">
<li>IOError / IOException  
</li>
<li>AsyncException
<ul class="org-ul">
<li>StackOverflow
</li>
<li>HeapOverflow
</li>
<li>ThreadKilled
</li>
<li>ThreadKilled
</li>
</ul>
</li>
<li>ArithException
<ul class="org-ul">
<li>Overflow
</li>
<li>Underflow
</li>
<li>LossOfPrecision
</li>
<li>DivideByZeror
</li>
<li>Denormal
</li>
<li>RatioZeroDenominator
</li>
</ul>
</li>
<li>ArrayException
</li>
<li>AssertionFailed
</li>
</ul>
</li>
</ul>


<p>
See also: 
</p>

<ul class="org-ul">
<li><a href="https://www.schoolofhaskell.com/user/commercial/content/exceptions-best-practices">Exceptions Best Practices - School of Haskell | School of Haskell</a>
</li>

<li><a href="https://www.schoolofhaskell.com/user/snoyberg/general-haskell/exceptions/catching-all-exceptions">Catching all exceptions - School of Haskell | School of Haskell</a>
</li>

<li><a href="https://en.wikibooks.org/wiki/Haskell/Libraries/IO">Haskell/Libraries/IO - Wikibooks, open books for an open world</a>
</li>

<li><a href="http://blog.ezyang.com/2011/08/8-ways-to-report-errors-in-haskell-revisited/">8 ways to report errors in Haskell revisited : Inside 736-131</a> 
</li>

<li><a href="http://www.randomhacks.net/2007/03/10/haskell-8-ways-to-report-errors/">8 ways to report errors in Haskell | Random Hacks</a>
</li>

<li><a href="https://wiki.haskell.org/Exception">Exception - HaskellWiki</a>
</li>

<li><a href="http://drunkcoding.tumblr.com/post/692076953/catching-exceptions-in-haskell">Coding like a drunk - Catching Exceptions in Haskell</a>
</li>
</ul>


<p>
Papers:
</p>

<ul class="org-ul">
<li>Marlow, S. - <b>An Extensible Dynamically-Typed Hierarchy of
Exceptions</b>. Available at
<a href="http://community.haskell.org/~simonmar/papers/ext-exceptions.pdf">http://community.haskell.org/~simonmar/papers/ext-exceptions.pdf</a>
</li>
</ul>
</div>
</div>
