haskell/haskell_handling_exceptions.org
*** Examples of Exceptions: 

#+BEGIN_SRC haskell 
  > div 10 0 

  ,*** Exception: divide by zero
  > > 
  > div 10 0 
  ,*** Exception: divide by zero
  > head [] 
  ,*** Exception: Prelude.head: empty list
  > let x = undefined :: Int 
  x :: Int
  > x 
  ,*** Exception: Prelude.undefined
  CallStack (from HasCallStack):
    error, called at libraries/base/GHC/Err.hs:79:14 in base:GHC.Err
    undefined, called at <interactive>:1741:9 in interactive:Ghci116
  > 

  > readFile "/etc/issue" 
  "Manjaro Linux \\r  (\\n) (\\l)\n\n\n"
  it :: String

  > readFile "/etc/issuesada" 
  ,*** Exception: /etc/issuesada: openFile: does not exist (No such file or directory)
  > 

  > readFile "/etc/shadow" 
  ,*** Exception: /etc/shadow: openFile: permission denied (Permission denied)
  >

  > readFile "/etc/" 
  ,*** Exception: /etc/: openFile: inappropriate type (is a directory)
  > 
  > readFile "/etcsad/" 
  ,*** Exception: /etcsad/: openFile: does not exist (No such file or directory)
  > 
  >

  > import qualified System.Directory as D

  > D.createDirectory "/etc/fstab/my-directory" 
  ,*** Exception: /etc/fstab/my-directory: createDirectory: inappropriate type (Not a directory)

  > D.createDirectory "/dev/sda1/dummy" 
  ,*** Exception: /dev/sda1/dummy: createDirectory: inappropriate type (Not a directory)

  > D.createDirectory "/i dont have permission" 
  ,*** Exception: /i dont have permission: createDirectory: permission denied (Permission denied)
  >   
#+END_SRC

*** Catching Exceptions with catch
**** Overview 

 - =catch <computation which may fail> <exception handler>= 
 - =catch :: Exception e => IO a -> (e -> IO a) -> IO a=

