haskell/haskell_handling_exceptions.html

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Examples of Exceptions:</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">div</span> 10 0 

<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> divide by zero
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">div</span> 10 0 
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> divide by zero
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">head</span> <span class="org-haskell-constructor">[]</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> Prelude.head<span class="org-haskell-constructor">:</span> empty list
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> x <span class="org-haskell-operator">=</span> undefined <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> 
<span class="org-haskell-definition">x</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> x 
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> Prelude.undefined
<span class="org-haskell-constructor">CallStack</span> (from <span class="org-haskell-constructor">HasCallStack</span>)<span class="org-haskell-constructor">:</span>
  error, called at libraries<span class="org-haskell-operator">/</span>base<span class="org-haskell-operator">/</span><span class="org-haskell-constructor">GHC</span><span class="org-haskell-operator">/</span>Err.hs<span class="org-haskell-constructor">:</span>79<span class="org-haskell-constructor">:</span>14 <span class="org-haskell-keyword">in</span> base<span class="org-haskell-constructor">:GHC.Err</span>
  undefined, called at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>1741<span class="org-haskell-constructor">:</span>9 <span class="org-haskell-keyword">in</span> interactive<span class="org-haskell-constructor">:Ghci116</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readFile</span> <span class="org-string">"/etc/issue"</span> 
<span class="org-string">"Manjaro Linux \\r  (\\n) (\\l)\n\n\n"</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readFile</span> <span class="org-string">"/etc/issuesada"</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/</span>issuesada<span class="org-haskell-type">:</span> openFile<span class="org-haskell-type">:</span> does not exist (<span class="org-haskell-type">No</span> such file or directory)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readFile</span> <span class="org-string">"/etc/shadow"</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/</span>shadow<span class="org-haskell-type">:</span> openFile<span class="org-haskell-type">:</span> permission denied (<span class="org-haskell-type">Permission</span> denied)
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readFile</span> <span class="org-string">"/etc/"</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/:</span> openFile<span class="org-haskell-type">:</span> inappropriate <span class="org-haskell-keyword">type</span> (is a directory)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readFile</span> <span class="org-string">"/etcsad/"</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> <span class="org-haskell-operator">/</span>etcsad<span class="org-haskell-operator">/:</span> openFile<span class="org-haskell-type">:</span> does not exist (<span class="org-haskell-type">No</span> such file or directory)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">System.Directory</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">D</span>

<span class="org-haskell-operator">&gt;</span> D<span class="org-haskell-definition">.</span>createDirectory <span class="org-string">"/etc/fstab/my-directory"</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/</span>fstab<span class="org-haskell-operator">/</span>my<span class="org-haskell-operator">-</span>directory<span class="org-haskell-constructor">:</span> createDirectory<span class="org-haskell-constructor">:</span> inappropriate <span class="org-haskell-keyword">type</span> (<span class="org-haskell-type">Not</span> a directory)

<span class="org-haskell-operator">&gt;</span> D<span class="org-haskell-definition">.</span>createDirectory <span class="org-string">"/dev/sda1/dummy"</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> <span class="org-haskell-operator">/</span>dev<span class="org-haskell-operator">/</span>sda1<span class="org-haskell-operator">/</span>dummy<span class="org-haskell-type">:</span> createDirectory<span class="org-haskell-type">:</span> inappropriate <span class="org-haskell-keyword">type</span> (<span class="org-haskell-type">Not</span> a directory)

<span class="org-haskell-operator">&gt;</span> D<span class="org-haskell-definition">.</span>createDirectory <span class="org-string">"/i dont have permission"</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> <span class="org-haskell-operator">/</span>i dont have permission<span class="org-haskell-type">:</span> createDirectory<span class="org-haskell-type">:</span> permission denied (<span class="org-haskell-type">Permission</span> denied)
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Catching Exceptions with catch</h4>
<div class="outline-text-4" id="text-1-3-3">
</div><div id="outline-container-sec-1-3-3-1" class="outline-5">
<h5 id="sec-1-3-3-1"><span class="section-number-5">1.3.3.1</span> Overview</h5>
<div class="outline-text-5" id="text-1-3-3-1">
<ul class="org-ul">
<li><code>catch &lt;computation which may fail&gt; &lt;exception handler&gt;</code> 
</li>
<li id="=catch">Exception e <code>&gt; IO a -&gt; (e -&gt; IO a) -&gt; IO a</code>
</li>
</ul>
</div>
</div>
