haskell/haskell_handling_exceptions.org
**** Catching all exceptions 

#+BEGIN_SRC haskell 
  import Control.Exception 

  > :t catch
  catch :: Exception e => IO a -> (e -> IO a) -> IO a
  >

  > :t catch (return $ Just $ div 10 0) (\(SomeException e) -> print  e >> return Nothing)
  catch (return $ Just $ div 10 0) (\(SomeException e) -> print  e >> return Nothing)
    :: Integral a => IO (Maybe a)

    
  > catch (return $ Just $ div 10 0) (\(SomeException e) -> print  e >> return Nothing)
  Just *** Exception: divide by zero
  > 

  > :t catch (return $ Just $ div 10 0) (\(SomeException e) -> print  e >> return Nothing)
  catch (return $ Just $ div 10 0) (\(SomeException e) -> print  e >> return Nothing)
    :: Integral a => IO (Maybe a)
  > 

  > catch (print $ div 10 0) (\(SomeException e) -> print $ e)
  divide by zero
  it :: ()
  > 

  > :t catch (print $ div 10 0) (\(SomeException e) -> print $ e)
  catch (print $ div 10 0) (\(SomeException e) -> print $ e) :: IO ()
  > 

  > catch (print $ div 10 0) (\(SomeException e) -> print $ typeOf e)
  ArithException
  it :: ()
  > 

  > :t catch (print $ div 10 0) (\(SomeException e) -> print $ typeOf e)
  catch (print $ div 10 0) (\(SomeException e) -> print $ typeOf e)
    :: IO ()
  > 


  :{
  testExceptionType :: IO () -> IO ()
  testExceptionType thunk =  catch thunk handler
    where
      -- Catch All Exceptions -- It is not recommended in real life.
      handler :: SomeException -> IO ()
      handler (SomeException e) = putStrLn $ "I caught an exception.\nMessage =  " ++ show e ++ "\nType of exception = " ++ show (typeOf e)
  :}  


  > testExceptionType (print $ div 10 0)
  I caught an exception.
  Message =  divide by zero
  Type of exception = ArithException
  it :: ()
  > 

  > testExceptionType (error "Fatal kernel error")
  I caught an exception.
  Message =  Fatal kernel error
  CallStack (from HasCallStack):
    error, called at <interactive>:82:20 in interactive:Ghci13
  Type of exception = ErrorCall
  it :: ()
  > 

  > testExceptionType (readFile "/etc/shadow" >>= putStrLn)
  I caught an exception.
  Message =  /etc/shadow: openFile: permission denied (Permission denied)
  Type of exception = IOException
  it :: ()
  > 

  > testExceptionType (readFile "/etc/" >>= putStrLn)
  I caught an exception.
  Message =  /etc/: openFile: inappropriate type (is a directory)
  Type of exception = IOException
  it :: ()
  > 

  > testExceptionType (readFile "/" >>= putStrLn)
  I caught an exception.
  Message =  /: openFile: inappropriate type (is a directory)
  Type of exception = IOException
  it :: ()
  > 


  > testExceptionType (ioError $ userError "I am throwing an Exception")
  I caught an exception.
  Message =  user error (I am throwing an Exception)
  Type of exception = IOException
  it :: ()
  > 
    
      
  > testExceptionType (print $ head [1, 2, 3])
  1
  it :: ()
  > testExceptionType (print $ head [])
  I caught an exception.
  Message =  Prelude.head: empty list
  Type of exception = ErrorCall
  it :: ()
  >   


    > testExceptionType (putStrLn "Insert a line" >> getLine >>= putStrLn)
  Insert a line
  some line
  some line
  it :: ()

  -- User enter Ctrl + C to cancel the current input.
  --
  > testExceptionType (putStrLn "Insert a line" >> getLine >>= putStrLn)
  Insert a line
  ^CI caught an exception.
  Message =  user interrupt
  Type of exception = SomeAsyncException
  it :: ()
  >

  > let x = undefined :: String 
  x :: String
  > 

  > testExceptionType (putStrLn x)
  I caught an exception.
  Message =  Prelude.undefined
  CallStack (from HasCallStack):
    error, called at libraries/base/GHC/Err.hs:79:14 in base:GHC.Err
    undefined, called at <interactive>:103:9 in interactive:Ghci21
  Type of exception = ErrorCall
  it :: ()
  >


    
#+END_SRC

