haskell/haskell_handling_exceptions.html

<div id="outline-container-sec-1-3-3-2" class="outline-5">
<h5 id="sec-1-3-3-2"><span class="section-number-5">1.3.3.2</span> Catching all exceptions</h5>
<div class="outline-text-5" id="text-1-3-3-2">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Exception</span> 
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Typeable</span> (typeOf)

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t catch
<span class="org-haskell-definition">catch</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Exception</span> e <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">IO</span> a <span class="org-haskell-operator">-&gt;</span> (e <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> a) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> a
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t catch (return <span class="org-haskell-operator">$</span> <span class="org-haskell-type">Just</span> <span class="org-haskell-operator">$</span> div 10 0) (<span class="org-haskell-operator">\</span>(<span class="org-haskell-type">SomeException</span> e) <span class="org-haskell-operator">-&gt;</span> print  e <span class="org-haskell-operator">&gt;&gt;</span> return <span class="org-haskell-type">Nothing</span>)
<span class="org-haskell-definition">catch</span> (return <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> div 10 0) (<span class="org-haskell-operator">\</span>(<span class="org-haskell-constructor">SomeException</span> e) <span class="org-haskell-operator">-&gt;</span> print  e <span class="org-haskell-operator">&gt;&gt;</span> return <span class="org-haskell-constructor">Nothing</span>)
  <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integral</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">IO</span> (<span class="org-haskell-type">Maybe</span> a)


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">catch</span> (return <span class="org-haskell-operator">$</span> <span class="org-haskell-type">Just</span> <span class="org-haskell-operator">$</span> div 10 0) (<span class="org-haskell-operator">\</span>(<span class="org-haskell-type">SomeException</span> e) <span class="org-haskell-operator">-&gt;</span> print  e <span class="org-haskell-operator">&gt;&gt;</span> return <span class="org-haskell-type">Nothing</span>)
<span class="org-haskell-constructor">Just</span> <span class="org-haskell-definition">***</span> <span class="org-haskell-constructor">Exception:</span> divide by zero
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t catch (return <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> div 10 0) (<span class="org-haskell-operator">\</span>(<span class="org-haskell-constructor">SomeException</span> e) <span class="org-haskell-operator">-&gt;</span> print  e <span class="org-haskell-operator">&gt;&gt;</span> return <span class="org-haskell-constructor">Nothing</span>)
<span class="org-haskell-definition">catch</span> (return <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> div 10 0) (<span class="org-haskell-operator">\</span>(<span class="org-haskell-constructor">SomeException</span> e) <span class="org-haskell-operator">-&gt;</span> print  e <span class="org-haskell-operator">&gt;&gt;</span> return <span class="org-haskell-constructor">Nothing</span>)
  <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integral</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">IO</span> (<span class="org-haskell-type">Maybe</span> a)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">catch</span> (print <span class="org-haskell-operator">$</span> div 10 0) (<span class="org-haskell-operator">\</span>(<span class="org-haskell-type">SomeException</span> e) <span class="org-haskell-operator">-&gt;</span> print <span class="org-haskell-operator">$</span> e)
<span class="org-haskell-definition">divide</span> by zero
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t catch (print <span class="org-haskell-operator">$</span> div 10 0) (<span class="org-haskell-operator">\</span>(<span class="org-haskell-type">SomeException</span> e) <span class="org-haskell-operator">-&gt;</span> print <span class="org-haskell-operator">$</span> e)
<span class="org-haskell-definition">catch</span> (print <span class="org-haskell-operator">$</span> div 10 0) (<span class="org-haskell-operator">\</span>(<span class="org-haskell-constructor">SomeException</span> e) <span class="org-haskell-operator">-&gt;</span> print <span class="org-haskell-operator">$</span> e) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">catch</span> (print <span class="org-haskell-operator">$</span> div 10 0) (<span class="org-haskell-operator">\</span>(<span class="org-haskell-type">SomeException</span> e) <span class="org-haskell-operator">-&gt;</span> print <span class="org-haskell-operator">$</span> typeOf e)
<span class="org-haskell-constructor">ArithException</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t catch (print <span class="org-haskell-operator">$</span> div 10 0) (<span class="org-haskell-operator">\</span>(<span class="org-haskell-type">SomeException</span> e) <span class="org-haskell-operator">-&gt;</span> print <span class="org-haskell-operator">$</span> typeOf e)
<span class="org-haskell-definition">catch</span> (print <span class="org-haskell-operator">$</span> div 10 0) (<span class="org-haskell-operator">\</span>(<span class="org-haskell-constructor">SomeException</span> e) <span class="org-haskell-operator">-&gt;</span> print <span class="org-haskell-operator">$</span> typeOf e)
  <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-type">:</span>{
<span class="org-haskell-definition">testExceptionType</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">testExceptionType</span> thunk <span class="org-haskell-operator">=</span>  catch thunk handler
  <span class="org-haskell-keyword">where</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">Catch All Exceptions -- It is not recommended in real life.</span>
    handler <span class="org-haskell-operator">::</span> <span class="org-haskell-type">SomeException</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
    handler (<span class="org-haskell-constructor">SomeException</span> e) <span class="org-haskell-operator">=</span> putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"I caught an exception.\nMessage =  "</span> <span class="org-haskell-operator">++</span> show e <span class="org-haskell-operator">++</span> <span class="org-string">"\nType of exception = "</span> <span class="org-haskell-operator">++</span> show (typeOf e)
<span class="org-haskell-constructor">:</span>}  


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testExceptionType</span> (print <span class="org-haskell-operator">$</span> div 10 0)
<span class="org-haskell-constructor">I</span> caught an exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">Message</span> <span class="org-haskell-operator">=</span>  divide by zero
<span class="org-haskell-constructor">Type</span> <span class="org-haskell-keyword">of</span> exception <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">ArithException</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testExceptionType</span> (error <span class="org-string">"Fatal kernel error"</span>)
<span class="org-haskell-constructor">I</span> caught an exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">Message</span> <span class="org-haskell-operator">=</span>  <span class="org-haskell-constructor">Fatal</span> kernel error
<span class="org-haskell-constructor">CallStack</span> (from <span class="org-haskell-constructor">HasCallStack</span>)<span class="org-haskell-constructor">:</span>
  error, called at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>82<span class="org-haskell-constructor">:</span>20 <span class="org-haskell-keyword">in</span> interactive<span class="org-haskell-constructor">:Ghci13</span>
<span class="org-haskell-constructor">Type</span> <span class="org-haskell-keyword">of</span> exception <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">ErrorCall</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testExceptionType</span> (readFile <span class="org-string">"/etc/shadow"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">I</span> caught an exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">Message</span> <span class="org-haskell-operator">=</span>  <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/</span>shadow<span class="org-haskell-constructor">:</span> openFile<span class="org-haskell-constructor">:</span> permission denied (<span class="org-haskell-constructor">Permission</span> denied)
<span class="org-haskell-constructor">Type</span> <span class="org-haskell-keyword">of</span> exception <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">IOException</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testExceptionType</span> (readFile <span class="org-string">"/etc/"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">I</span> caught an exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">Message</span> <span class="org-haskell-operator">=</span>  <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/:</span> openFile<span class="org-haskell-constructor">:</span> inappropriate <span class="org-haskell-keyword">type</span> (is a directory)
<span class="org-haskell-constructor">Type</span> <span class="org-haskell-keyword">of</span> exception <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">IOException</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testExceptionType</span> (readFile <span class="org-string">"/"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">I</span> caught an exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">Message</span> <span class="org-haskell-operator">=</span>  <span class="org-haskell-operator">/:</span> openFile<span class="org-haskell-constructor">:</span> inappropriate <span class="org-haskell-keyword">type</span> (is a directory)
<span class="org-haskell-constructor">Type</span> <span class="org-haskell-keyword">of</span> exception <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">IOException</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testExceptionType</span> (ioError <span class="org-haskell-operator">$</span> userError <span class="org-string">"I am throwing an Exception"</span>)
<span class="org-haskell-constructor">I</span> caught an exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">Message</span> <span class="org-haskell-operator">=</span>  user error (<span class="org-haskell-constructor">I</span> am throwing an <span class="org-haskell-constructor">Exception</span>)
<span class="org-haskell-constructor">Type</span> <span class="org-haskell-keyword">of</span> exception <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">IOException</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testExceptionType</span> (print <span class="org-haskell-operator">$</span> head [1, 2, 3])
1
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testExceptionType</span> (print <span class="org-haskell-operator">$</span> head <span class="org-haskell-constructor">[]</span>)
<span class="org-haskell-constructor">I</span> caught an exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">Message</span> <span class="org-haskell-operator">=</span>  Prelude.head<span class="org-haskell-constructor">:</span> empty list
<span class="org-haskell-constructor">Type</span> <span class="org-haskell-keyword">of</span> exception <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">ErrorCall</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>   


  <span class="org-haskell-operator">&gt;</span> testExceptionType (putStrLn <span class="org-string">"Insert a line"</span> <span class="org-haskell-operator">&gt;&gt;</span> getLine <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Insert</span> a line
<span class="org-haskell-definition">some</span> line
<span class="org-haskell-definition">some</span> line
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">User enter Ctrl + C to cancel the current input.</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testExceptionType</span> (putStrLn <span class="org-string">"Insert a line"</span> <span class="org-haskell-operator">&gt;&gt;</span> getLine <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Insert</span> a line
<span class="org-haskell-operator">^</span><span class="org-haskell-constructor">CI</span> caught an exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">Message</span> <span class="org-haskell-operator">=</span>  user interrupt
<span class="org-haskell-constructor">Type</span> <span class="org-haskell-keyword">of</span> exception <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">SomeAsyncException</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> x <span class="org-haskell-operator">=</span> undefined <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> 
<span class="org-haskell-definition">x</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testExceptionType</span> (putStrLn x)
<span class="org-haskell-constructor">I</span> caught an exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">Message</span> <span class="org-haskell-operator">=</span>  Prelude.undefined
<span class="org-haskell-constructor">CallStack</span> (from <span class="org-haskell-constructor">HasCallStack</span>)<span class="org-haskell-constructor">:</span>
  error, called at libraries<span class="org-haskell-operator">/</span>base<span class="org-haskell-operator">/</span><span class="org-haskell-constructor">GHC</span><span class="org-haskell-operator">/</span>Err.hs<span class="org-haskell-constructor">:</span>79<span class="org-haskell-constructor">:</span>14 <span class="org-haskell-keyword">in</span> base<span class="org-haskell-constructor">:GHC.Err</span>
  undefined, called at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>103<span class="org-haskell-constructor">:</span>9 <span class="org-haskell-keyword">in</span> interactive<span class="org-haskell-constructor">:Ghci21</span>
<span class="org-haskell-constructor">Type</span> <span class="org-haskell-keyword">of</span> exception <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">ErrorCall</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
