haskell/haskell_handling_exceptions.org
**** Narrowing Exceptions

Catches only arithmetic exceptions while ignoring other types of
exceptions. 

#+BEGIN_SRC haskell 

  :{
  testException :: IO () -> IO ()
  testException ioAction =  catch ioAction handler
      where
        handler :: ArithException -> IO ()
        handler e =  putStrLn $ "I got an Arithmetic exception which message is = " ++ show e
  :}

  > testException (print $ div 100 10)
  10
  it :: ()
  > 

  {-- It only will handle Arithmetic exception ignoring all other types of Exceptions. -}
  > testException (print $ div 100 0)
  I got an Arithmetic exception which message is = divide by zero
  it :: ()
  >

  > testException (error "Unrecoverable exception.")
  ,*** Exception: Unrecoverable exception.
  CallStack (from HasCallStack):
    error, called at <interactive>:60:16 in interactive:Ghci9
  > 

  > testException (readFile "/etc/DoesntExist" >>= putStrLn)
  ,*** Exception: /etc/DoesntExist: openFile: does not exist (No such file or directory)
  > 


  {- Narrow Arithmetic Exceptions -}^

  :{  
  testArithExceptions :: IO () -> IO ()
  testArithExceptions thunk = catch thunk handler
    where
      handler :: ArithException -> IO ()
      handler e = case e of
                  Overflow     -> putStrLn "I got an Arithmetic / Overflow Exception"
                  Underflow    -> putStrLn "I got an Arithmetic / Underflow Exception"
                  DivideByZero -> putStrLn "I got an Arithmetic exception / DvideByZero."
                  _            -> putStrLn "FIXME: I don't know how to handle this exception."
  :}                

  > testArithExceptions (print $ 1000 `div` 10)
  100
  it :: ()
  >

  > testArithExceptions (print $ 1000 `div` 0)
  I got an Arithmetic exception / DvideByZero.
  it :: ()
  > 

  > testArithExceptions (throw DivideByZero )
  I got an Arithmetic exception / DvideByZero.
  it :: ()
  > 

  > testArithExceptions (throw Overflow)
  I got an Arithmetic / Overflow Exception
  it :: ()
  > 

  > testArithExceptions (throw Underflow)
  I got an Arithmetic / Underflow Exception
  it :: ()
  > 

  > testArithExceptions (throw LossOfPrecision )
  FIXME: I don't know how to handle this exception.
  it :: ()
  > 

  > testArithExceptions (throw RatioZeroDenominator)
  FIXME: I don't know how to handle this exception.
  it :: ()
  > 

  > testArithExceptions (readFile "/etc/issue" >>= putStrLn)
  Manjaro Linux \r  (\n) (\l)



  it :: ()
  > 

  > testArithExceptions (readFile "/etc/issuesad" >>= putStrLn)
  ,*** Exception: /etc/issuesad: openFile: does not exist (No such file or directory)
  > 

  > testArithExceptions (readFile "/etc/shadow" >>= putStrLn)
  ,*** Exception: /etc/shadow: openFile: permission denied (Permission denied)
  >

  :{
  testIOExceptions :: IO () -> IO ()
  testIOExceptions thunk = catch thunk handler
    where
      -- IOError is an alias to IOException
      handler :: IOError -> IO ()
      handler e = putStrLn $ "I got an IO exception.\nMessage is =" ++ show e
  :}

  > testIOExceptions (readFile "/proc/version" >>= putStrLn)
  Linux version 4.4.21-1-MANJARO (builduser@manjaro) (gcc version 6.2.1 20160830 (GCC) ) #1 SMP PREEMPT Thu Sep 15 19:16:23 UTC 2016

  it :: ()
  > 
  >

  > testIOExceptions (readFile "/proc/91" >>= putStrLn)
  I got an IO exception.
  Message is =/proc/91: openFile: inappropriate type (is a directory)
  it :: ()
  > 

  > testIOExceptions (readFile "/proc/" >>= putStrLn)
  I got an IO exception.
  Message is =/proc/: openFile: inappropriate type (is a directory)
  it :: ()
  > 

  > testIOExceptions (readFile "/etc/shadow" >>= putStrLn)
  I got an IO exception.
  Message is =/etc/shadow: openFile: permission denied (Permission denied)
  it :: ()
  >

  > testIOExceptions (error "Raising an error")
  ,*** Exception: Raising an error
  CallStack (from HasCallStack):
    error, called at <interactive>:221:19 in interactive:Ghci39
  > 

  > testIOExceptions (throw DivideByZero )
  ,*** Exception: divide by zero
  > 

  > testIOExceptions (print $ div 10 0)
  ,*** Exception: divide by zero
  > 

  > testIOExceptions (putStr undefined )
  ,*** Exception: Prelude.undefined
  CallStack (from HasCallStack):
    error, called at libraries/base/GHC/Err.hs:79:14 in base:GHC.Err
    undefined, called at <interactive>:235:26 in interactive:Ghci40
  > 
  > 
  >

    
    
    
    
#+END_SRC

