haskell/haskell_handling_exceptions.html

<div id="outline-container-sec-1-3-3-3" class="outline-5">
<h5 id="sec-1-3-3-3"><span class="section-number-5">1.3.3.3</span> Narrowing Exceptions</h5>
<div class="outline-text-5" id="text-1-3-3-3">
<p>
Catches only arithmetic exceptions while ignoring other types of
exceptions. 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">testException</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">testException</span> ioAction <span class="org-haskell-operator">=</span>  catch ioAction handler
    <span class="org-haskell-keyword">where</span>
      handler <span class="org-haskell-operator">::</span> <span class="org-haskell-type">ArithException</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
      handler e <span class="org-haskell-operator">=</span>  putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"I got an Arithmetic exception which message is = "</span> <span class="org-haskell-operator">++</span> show e
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testException</span> (print <span class="org-haskell-operator">$</span> div 100 10)
10
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{-</span><span class="org-comment">- It only will handle Arithmetic exception ignoring all other types of Exceptions. -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testException</span> (print <span class="org-haskell-operator">$</span> div 100 0)
<span class="org-haskell-constructor">I</span> got an <span class="org-haskell-constructor">Arithmetic</span> exception which message is <span class="org-haskell-operator">=</span> divide by zero
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testException</span> (error <span class="org-string">"Unrecoverable exception."</span>)
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> <span class="org-haskell-type">Unrecoverable</span> exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-type">CallStack</span> (from <span class="org-haskell-type">HasCallStack</span>)<span class="org-haskell-type">:</span>
  error, called at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>60<span class="org-haskell-constructor">:</span>16 <span class="org-haskell-keyword">in</span> interactive<span class="org-haskell-constructor">:Ghci9</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testException</span> (readFile <span class="org-string">"/etc/DoesntExist"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/</span><span class="org-haskell-constructor">DoesntExist:</span> openFile<span class="org-haskell-constructor">:</span> does not exist (<span class="org-haskell-constructor">No</span> such file or directory)
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">{- </span><span class="org-comment">Narrow Arithmetic Exceptions -}</span><span class="org-haskell-operator">^</span>

<span class="org-haskell-constructor">:</span>{  
<span class="org-haskell-definition">testArithExceptions</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">testArithExceptions</span> thunk <span class="org-haskell-operator">=</span> catch thunk handler
  <span class="org-haskell-keyword">where</span>
    handler <span class="org-haskell-operator">::</span> <span class="org-haskell-type">ArithException</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
    handler e <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">case</span> e <span class="org-haskell-keyword">of</span>
                <span class="org-haskell-constructor">Overflow</span>     <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"I got an Arithmetic / Overflow Exception"</span>
                <span class="org-haskell-constructor">Underflow</span>    <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"I got an Arithmetic / Underflow Exception"</span>
                <span class="org-haskell-constructor">DivideByZero</span> <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"I got an Arithmetic exception / DvideByZero."</span>
                <span class="org-haskell-keyword">_</span>            <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"FIXME: I don't know how to handle this exception."</span>
<span class="org-haskell-constructor">:</span>}                

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testArithExceptions</span> (print <span class="org-haskell-operator">$</span> 1000 <span class="org-haskell-operator">`div`</span> 10)
100
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testArithExceptions</span> (print <span class="org-haskell-operator">$</span> 1000 <span class="org-haskell-operator">`div`</span> 0)
<span class="org-haskell-constructor">I</span> got an <span class="org-haskell-constructor">Arithmetic</span> exception <span class="org-haskell-operator">/</span> DvideByZero.
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testArithExceptions</span> (throw <span class="org-haskell-type">DivideByZero</span> )
<span class="org-haskell-constructor">I</span> got an <span class="org-haskell-constructor">Arithmetic</span> exception <span class="org-haskell-operator">/</span> DvideByZero.
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testArithExceptions</span> (throw <span class="org-haskell-type">Overflow</span>)
<span class="org-haskell-constructor">I</span> got an <span class="org-haskell-constructor">Arithmetic</span> <span class="org-haskell-operator">/</span> <span class="org-haskell-constructor">Overflow</span> <span class="org-haskell-constructor">Exception</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testArithExceptions</span> (throw <span class="org-haskell-type">Underflow</span>)
<span class="org-haskell-constructor">I</span> got an <span class="org-haskell-constructor">Arithmetic</span> <span class="org-haskell-operator">/</span> <span class="org-haskell-constructor">Underflow</span> <span class="org-haskell-constructor">Exception</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testArithExceptions</span> (throw <span class="org-haskell-type">LossOfPrecision</span> )
<span class="org-haskell-constructor">FIXME</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">I</span> don't know how to handle this exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testArithExceptions</span> (throw <span class="org-haskell-type">RatioZeroDenominator</span>)
<span class="org-haskell-constructor">FIXME</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">I</span> don't know how to handle this exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testArithExceptions</span> (readFile <span class="org-string">"/etc/issue"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Manjaro</span> <span class="org-haskell-constructor">Linux</span> <span class="org-haskell-operator">\</span>r  (<span class="org-haskell-operator">\</span>n) (<span class="org-haskell-operator">\</span>l)



<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testArithExceptions</span> (readFile <span class="org-string">"/etc/issuesad"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/</span>issuesad<span class="org-haskell-type">:</span> openFile<span class="org-haskell-type">:</span> does not exist (<span class="org-haskell-type">No</span> such file or directory)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testArithExceptions</span> (readFile <span class="org-string">"/etc/shadow"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/</span>shadow<span class="org-haskell-type">:</span> openFile<span class="org-haskell-type">:</span> permission denied (<span class="org-haskell-type">Permission</span> denied)
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-type">:</span>{
<span class="org-haskell-definition">testIOExceptions</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">testIOExceptions</span> thunk <span class="org-haskell-operator">=</span> catch thunk handler
  <span class="org-haskell-keyword">where</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">IOError is an alias to IOException</span>
    handler <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IOError</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
    handler e <span class="org-haskell-operator">=</span> putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"I got an IO exception.\nMessage is ="</span> <span class="org-haskell-operator">++</span> show e
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testIOExceptions</span> (readFile <span class="org-string">"/proc/version"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Linux</span> version 4.4<span class="org-haskell-operator">.</span>21<span class="org-haskell-operator">-</span>1<span class="org-haskell-operator">-</span><span class="org-haskell-constructor">MANJARO</span> (builduser<span class="org-haskell-operator">@</span>manjaro) (gcc version 6.2<span class="org-haskell-operator">.</span>1 20160830 (<span class="org-haskell-constructor">GCC</span>) ) <span class="org-haskell-operator">#</span>1 <span class="org-haskell-constructor">SMP</span> <span class="org-haskell-constructor">PREEMPT</span> <span class="org-haskell-constructor">Thu</span> <span class="org-haskell-constructor">Sep</span> 15 19<span class="org-haskell-constructor">:</span>16<span class="org-haskell-constructor">:</span>23 <span class="org-haskell-constructor">UTC</span> 2016

<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testIOExceptions</span> (readFile <span class="org-string">"/proc/91"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">I</span> got an <span class="org-haskell-constructor">IO</span> exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">Message</span> is <span class="org-haskell-operator">=/</span><span class="org-haskell-keyword">proc</span><span class="org-haskell-operator">/</span>91<span class="org-haskell-constructor">:</span> openFile<span class="org-haskell-constructor">:</span> inappropriate <span class="org-haskell-keyword">type</span> (is a directory)
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testIOExceptions</span> (readFile <span class="org-string">"/proc/"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">I</span> got an <span class="org-haskell-constructor">IO</span> exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">Message</span> is <span class="org-haskell-operator">=/</span><span class="org-haskell-keyword">proc</span><span class="org-haskell-operator">/:</span> openFile<span class="org-haskell-constructor">:</span> inappropriate <span class="org-haskell-keyword">type</span> (is a directory)
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testIOExceptions</span> (readFile <span class="org-string">"/etc/shadow"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">I</span> got an <span class="org-haskell-constructor">IO</span> exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">Message</span> is <span class="org-haskell-operator">=/</span>etc<span class="org-haskell-operator">/</span>shadow<span class="org-haskell-constructor">:</span> openFile<span class="org-haskell-constructor">:</span> permission denied (<span class="org-haskell-constructor">Permission</span> denied)
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testIOExceptions</span> (error <span class="org-string">"Raising an error"</span>)
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> <span class="org-haskell-type">Raising</span> an error
<span class="org-haskell-constructor">CallStack</span> (from <span class="org-haskell-constructor">HasCallStack</span>)<span class="org-haskell-constructor">:</span>
  error, called at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>221<span class="org-haskell-constructor">:</span>19 <span class="org-haskell-keyword">in</span> interactive<span class="org-haskell-constructor">:Ghci39</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testIOExceptions</span> (throw <span class="org-haskell-constructor">DivideByZero</span> )
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> divide by zero
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testIOExceptions</span> (print <span class="org-haskell-operator">$</span> div 10 0)
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> divide by zero
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testIOExceptions</span> (putStr undefined )
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> Prelude.undefined
<span class="org-haskell-constructor">CallStack</span> (from <span class="org-haskell-constructor">HasCallStack</span>)<span class="org-haskell-constructor">:</span>
  error, called at libraries<span class="org-haskell-operator">/</span>base<span class="org-haskell-operator">/</span><span class="org-haskell-constructor">GHC</span><span class="org-haskell-operator">/</span>Err.hs<span class="org-haskell-constructor">:</span>79<span class="org-haskell-constructor">:</span>14 <span class="org-haskell-keyword">in</span> base<span class="org-haskell-constructor">:GHC.Err</span>
  undefined, called at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>235<span class="org-haskell-constructor">:</span>26 <span class="org-haskell-keyword">in</span> interactive<span class="org-haskell-constructor">:Ghci40</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
