haskell/haskell_handling_exceptions.org
**** Narrowing IO Exceptions 

The IO Exception type is an opaque type or abstract type which the
implementation or type constructors are not exposed like
ArithException, therefore the only way to find the type of IO
exception is by using IO Exception predicates available at
[[https://hackage.haskell.org/package/base-4.9.0.0/docs/System-IO-Error.html][System.IO.Error]] module. 

#+BEGIN_SRC haskell 
  import Control.Exception
  import System.IO.Error

  > 
  > :t catch
  catch :: Exception e => IO a -> (e -> IO a) -> IO a
  > 
  > :t throw
  throw :: Exception e => e -> a
  > 
  > :t throwIO
  throwIO :: Exception e => e -> IO a
  > 


  {- IOError is an alias for IO Exception -}
  > :info IOError 
  type IOError = IOException      -- Defined in ‘GHC.IO.Exception’
  > 

  > :t ioError 
  ioError :: IOError -> IO a
  > 
    
  -- Pasting it in the repl:
  {- The function ioError is used to throw a non-caught Exception inside an Exception handler.
     because this exception handler catches all IO exceptions;
  -}  
  :{
  catch (readFile "/etc/" >>= putStrLn)
        (\e ->  case e of
                _  | isAlreadyExistsError e -> putStrLn "Error: File alredy exists"
                _  | isEOFError e           -> putStrLn "Error: End of file"
                _  | isUserError e          -> putStrLn "Error: User raised an exception"
                _  | isPermissionError e    -> putStrLn "Error: We don't have permission to read this file"
                _                           -> putStrLn "Uncaught exception" >> ioError e
         )
  :}



  > :{
  - catch (readFile "/etc/" >>= putStrLn)
  -       (\e ->  case e of
  -               _  | isAlreadyExistsError e -> putStrLn "Error: File alredy exists"
  -               _  | isEOFError e           -> putStrLn "Error: End of file"
  -               _  | isUserError e          -> putStrLn "Error: User raised an exception"
  -               _  | isPermissionError e    -> putStrLn "Error: We don't have permission to read this file"
  -               _                           -> putStrLn "Uncaught exception" >> ioError e
  -        )
  - :}
  Uncaught exception
  ,*** Exception: /etc/: openFile: inappropriate type (is a directory)
  > 



  :{
  ioExceptionTester :: IO () -> IO ()   
  ioExceptionTester thunk = catch thunk handler 
    where
      handler :: IOError -> IO ()
      handler e = do  
        putStrLn $ "Exception message = " ++ show e 
        case e of
          _ | isAlreadyExistsError e -> putStrLn "Error: Already Exists"
          _ | isDoesNotExistError e  -> putStrLn "Error: Doesn't exists"               
          _ | isEOFError e           -> putStrLn "Error: End of file"
          _ | isIllegalOperation e   -> putStrLn "Error: Illegal operation"
          _ | isPermissionError e    -> putStrLn "Error: Permission error"
          _ | isUserError e          -> putStrLn "Error: User error"              
          _                          -> do putStrLn "Error: I can't handler this type of error."
                                           ioError e -- Raise uncaught exception 
  :}

  > ioExceptionTester (readFile "/etc/issue" >>= putStrLn)
  Manjaro Linux \r  (\n) (\l)



  it :: ()
  > 

  > ioExceptionTester (readFile "/etc/issuesddfs" >>= putStrLn)
  Exception message = /etc/issuesddfs: openFile: does not exist (No such file or directory)
  Error: Doesn't exists
  it :: ()
  > 

  > ioExceptionTester (readFile "/etc/" >>= putStrLn)
  Exception message = /etc/: openFile: inappropriate type (is a directory)
  Error: I can't handler this type of error.
  ,*** Exception: /etc/: openFile: inappropriate type (is a directory)
  > 
    
  > ioExceptionTester (readFile "/etc/shadow" >>= putStrLn)
  Exception message = /etc/shadow: openFile: permission denied (Permission denied)
  Error: Permission error
  it :: ()
  > 


  > import qualified System.Directory as D
  D.createDirectory :: FilePath -> IO ()
  >


  > D.createDirectory "/test"
  ,*** Exception: /test: createDirectory: permission denied (Permission denied)
  >

     
  > ioExceptionTester $ D.createDirectory "/test"
  Exception message = /test: createDirectory: permission denied (Permission denied)
  Error: Permission error
  it :: ()
  >   

  > ioExceptionTester $ D.createDirectory "/tmp/test"
  it :: ()
  > ioExceptionTester $ D.createDirectory "/tmp/test"
  Exception message = /tmp/test: createDirectory: already exists (File exists)
  Error: Already Exists
  it :: ()
  > 

  > ioExceptionTester $ D.createDirectory "/dev/test"
  Exception message = /dev/test: createDirectory: permission denied (Permission denied)
  Error: Permission error
  it :: ()
  > ioExceptionTester $ D.createDirectory "/dev/sda1"
  Exception message = /dev/sda1: createDirectory: already exists (File exists)
  Error: Already Exists
  it :: ()
  > 

  > ioExceptionTester $ throw (userError "I am raising an Error")
  Exception message = user error (I am raising an Error)
  Error: User error
  it :: ()
  > 
  >   
    
  {--============= It doesn't catch non IO exceptions ============== -}

  > ioExceptionTester (print $ div 10 0)
  ,*** Exception: divide by zero
  > 


  > ioExceptionTester (putStrLn undefined)
  ,*** Exception: Prelude.undefined
  CallStack (from HasCallStack):
    error, called at libraries/base/GHC/Err.hs:79:14 in base:GHC.Err
    undefined, called at <interactive>:310:29 in interactive:Ghci41
  > 

  >  ioExceptionTester (print (read "100" :: Int))
  100
  it :: ()

  > ioExceptionTester (print (read "10asd0" :: Int))
  ,*** Exception: Prelude.read: no parse
  > 


  > ioExceptionTester $ throw Underflow
  ,*** Exception: arithmetic underflow
  > 
  >   
  > ioExceptionTester $ throw DivideByZero 
  ,*** Exception: divide by zero

  --- Async Exception - User interrupt 
  > ioExceptionTester (putStrLn "Enter something" >> getLine >>= putStrLn)
  Enter something
  ^CInterrupted.
  > 

    
#+END_SRC

