haskell/haskell_handling_exceptions.html

<div id="outline-container-sec-1-3-3-4" class="outline-5">
<h5 id="sec-1-3-3-4"><span class="section-number-5">1.3.3.4</span> Narrowing IO Exceptions</h5>
<div class="outline-text-5" id="text-1-3-3-4">
<p>
The IO Exception type is an opaque type or abstract type which the
implementation or type constructors are not exposed like
ArithException, therefore the only way to find the type of IO
exception is by using IO Exception predicates available at
<a href="https://hackage.haskell.org/package/base-4.9.0.0/docs/System-IO-Error.html">System.IO.Error</a> module. 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Exception</span>
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">System.IO.Error</span>

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t catch
<span class="org-haskell-definition">catch</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Exception</span> e <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">IO</span> a <span class="org-haskell-operator">-&gt;</span> (e <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> a) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t throw
<span class="org-haskell-definition">throw</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Exception</span> e <span class="org-haskell-operator">=&gt;</span> e <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t throwIO
<span class="org-haskell-definition">throwIO</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Exception</span> e <span class="org-haskell-operator">=&gt;</span> e <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> a
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">{- </span><span class="org-comment">IOError is an alias for IO Exception -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>info <span class="org-haskell-type">IOError</span> 
<span class="org-haskell-keyword">type</span> <span class="org-haskell-type">IOError</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-type">IOException</span>      <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.IO.Exception&#8217;</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t ioError 
<span class="org-haskell-definition">ioError</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IOError</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> a
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Pasting it in the repl:</span>
<span class="org-comment-delimiter">{- </span><span class="org-comment">The function ioError is used to throw a non-caught Exception inside an Exception handler.</span>
<span class="org-comment">   because this exception handler catches all IO exceptions;</span>
<span class="org-comment">-}</span>  
<span class="org-haskell-type">:</span>{
<span class="org-haskell-definition">catch</span> (readFile <span class="org-string">"/etc/"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
      (<span class="org-haskell-operator">\</span>e <span class="org-haskell-operator">-&gt;</span>  <span class="org-haskell-keyword">case</span> e <span class="org-haskell-keyword">of</span>
              <span class="org-haskell-keyword">_</span>  <span class="org-haskell-operator">|</span> isAlreadyExistsError e <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: File alredy exists"</span>
              <span class="org-haskell-keyword">_</span>  <span class="org-haskell-operator">|</span> isEOFError e           <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: End of file"</span>
              <span class="org-haskell-keyword">_</span>  <span class="org-haskell-operator">|</span> isUserError e          <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: User raised an exception"</span>
              <span class="org-haskell-keyword">_</span>  <span class="org-haskell-operator">|</span> isPermissionError e    <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: We don't have permission to read this file"</span>
              <span class="org-haskell-keyword">_</span>                           <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Uncaught exception"</span> <span class="org-haskell-operator">&gt;&gt;</span> ioError e
       )
<span class="org-haskell-constructor">:</span>}



<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>{
<span class="org-haskell-operator">-</span> catch (readFile <span class="org-string">"/etc/"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-operator">-</span>       (<span class="org-haskell-operator">\</span>e <span class="org-haskell-operator">-&gt;</span>  <span class="org-haskell-keyword">case</span> e <span class="org-haskell-keyword">of</span>
<span class="org-haskell-operator">-</span>               <span class="org-haskell-keyword">_</span>  <span class="org-haskell-operator">|</span> isAlreadyExistsError e <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: File alredy exists"</span>
<span class="org-haskell-operator">-</span>               <span class="org-haskell-keyword">_</span>  <span class="org-haskell-operator">|</span> isEOFError e           <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: End of file"</span>
<span class="org-haskell-operator">-</span>               <span class="org-haskell-keyword">_</span>  <span class="org-haskell-operator">|</span> isUserError e          <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: User raised an exception"</span>
<span class="org-haskell-operator">-</span>               <span class="org-haskell-keyword">_</span>  <span class="org-haskell-operator">|</span> isPermissionError e    <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: We don't have permission to read this file"</span>
<span class="org-haskell-operator">-</span>               <span class="org-haskell-keyword">_</span>                           <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Uncaught exception"</span> <span class="org-haskell-operator">&gt;&gt;</span> ioError e
<span class="org-haskell-operator">-</span>        )
<span class="org-haskell-operator">-</span> <span class="org-haskell-constructor">:</span>}
<span class="org-haskell-constructor">Uncaught</span> exception
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/:</span> openFile<span class="org-haskell-constructor">:</span> inappropriate <span class="org-haskell-keyword">type</span> (is a directory)
<span class="org-haskell-operator">&gt;</span> 



<span class="org-haskell-type">:</span>{
<span class="org-haskell-definition">ioExceptionTester</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>   
<span class="org-haskell-definition">ioExceptionTester</span> thunk <span class="org-haskell-operator">=</span> catch thunk handler 
  <span class="org-haskell-keyword">where</span>
    handler <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IOError</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
    handler e <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>  
      putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"Exception message = "</span> <span class="org-haskell-operator">++</span> show e 
      <span class="org-haskell-keyword">case</span> e <span class="org-haskell-keyword">of</span>
        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> isAlreadyExistsError e <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: Already Exists"</span>
        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> isDoesNotExistError e  <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: Doesn't exists"</span>               
        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> isEOFError e           <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: End of file"</span>
        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> isIllegalOperation e   <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: Illegal operation"</span>
        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> isPermissionError e    <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: Permission error"</span>
        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> isUserError e          <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: User error"</span>              
        <span class="org-haskell-keyword">_</span>                          <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span> putStrLn <span class="org-string">"Error: I can't handler this type of error."</span>
                                         ioError e <span class="org-comment-delimiter">-- </span><span class="org-comment">Raise uncaught exception </span>
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (readFile <span class="org-string">"/etc/issue"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Manjaro</span> <span class="org-haskell-constructor">Linux</span> <span class="org-haskell-operator">\</span>r  (<span class="org-haskell-operator">\</span>n) (<span class="org-haskell-operator">\</span>l)



<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (readFile <span class="org-string">"/etc/issuesddfs"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/</span>issuesddfs<span class="org-haskell-constructor">:</span> openFile<span class="org-haskell-constructor">:</span> does not exist (<span class="org-haskell-constructor">No</span> such file or directory)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">Doesn't</span> exists
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (readFile <span class="org-string">"/etc/"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/:</span> openFile<span class="org-haskell-constructor">:</span> inappropriate <span class="org-haskell-keyword">type</span> (is a directory)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">I</span> can't handler this <span class="org-haskell-keyword">type</span> <span class="org-haskell-keyword">of</span> error<span class="org-haskell-operator">.</span>
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/:</span> openFile<span class="org-haskell-constructor">:</span> inappropriate <span class="org-haskell-keyword">type</span> (is a directory)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (readFile <span class="org-string">"/etc/shadow"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/</span>shadow<span class="org-haskell-constructor">:</span> openFile<span class="org-haskell-constructor">:</span> permission denied (<span class="org-haskell-constructor">Permission</span> denied)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">Permission</span> error
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">System.Directory</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">D</span>
D<span class="org-haskell-definition">.</span>createDirectory <span class="org-haskell-operator">::</span> <span class="org-haskell-type">FilePath</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>


<span class="org-haskell-operator">&gt;</span> D<span class="org-haskell-definition">.</span>createDirectory <span class="org-string">"/test"</span>
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> <span class="org-haskell-operator">/</span>test<span class="org-haskell-type">:</span> createDirectory<span class="org-haskell-type">:</span> permission denied (<span class="org-haskell-type">Permission</span> denied)
<span class="org-haskell-operator">&gt;</span>


<span class="org-haskell-operator">&gt;</span> ioExceptionTester <span class="org-haskell-definition">$</span> D.createDirectory <span class="org-string">"/test"</span>
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">/</span>test<span class="org-haskell-constructor">:</span> createDirectory<span class="org-haskell-constructor">:</span> permission denied (<span class="org-haskell-constructor">Permission</span> denied)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">Permission</span> error
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>   

<span class="org-haskell-operator">&gt;</span> ioExceptionTester <span class="org-haskell-definition">$</span> D.createDirectory <span class="org-string">"/tmp/test"</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> ioExceptionTester <span class="org-haskell-definition">$</span> D.createDirectory <span class="org-string">"/tmp/test"</span>
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>test<span class="org-haskell-constructor">:</span> createDirectory<span class="org-haskell-constructor">:</span> already exists (<span class="org-haskell-constructor">File</span> exists)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">Already</span> <span class="org-haskell-constructor">Exists</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> ioExceptionTester <span class="org-haskell-definition">$</span> D.createDirectory <span class="org-string">"/dev/test"</span>
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">/</span>dev<span class="org-haskell-operator">/</span>test<span class="org-haskell-constructor">:</span> createDirectory<span class="org-haskell-constructor">:</span> permission denied (<span class="org-haskell-constructor">Permission</span> denied)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">Permission</span> error
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> ioExceptionTester <span class="org-haskell-definition">$</span> D.createDirectory <span class="org-string">"/dev/sda1"</span>
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">/</span>dev<span class="org-haskell-operator">/</span>sda1<span class="org-haskell-constructor">:</span> createDirectory<span class="org-haskell-constructor">:</span> already exists (<span class="org-haskell-constructor">File</span> exists)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">Already</span> <span class="org-haskell-constructor">Exists</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> ioExceptionTester <span class="org-haskell-definition">$</span> throw (userError <span class="org-string">"I am raising an Error"</span>)
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> user error (<span class="org-haskell-constructor">I</span> am raising an <span class="org-haskell-constructor">Error</span>)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">User</span> error
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>   

<span class="org-comment-delimiter">{-</span><span class="org-comment">-============= It doesn't catch non IO exceptions ============== -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (print <span class="org-haskell-operator">$</span> div 10 0)
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> divide by zero
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (putStrLn undefined)
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> Prelude.undefined
<span class="org-haskell-constructor">CallStack</span> (from <span class="org-haskell-constructor">HasCallStack</span>)<span class="org-haskell-constructor">:</span>
  error, called at libraries<span class="org-haskell-operator">/</span>base<span class="org-haskell-operator">/</span><span class="org-haskell-constructor">GHC</span><span class="org-haskell-operator">/</span>Err.hs<span class="org-haskell-constructor">:</span>79<span class="org-haskell-constructor">:</span>14 <span class="org-haskell-keyword">in</span> base<span class="org-haskell-constructor">:GHC.Err</span>
  undefined, called at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>310<span class="org-haskell-constructor">:</span>29 <span class="org-haskell-keyword">in</span> interactive<span class="org-haskell-constructor">:Ghci41</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span>  ioExceptionTester (print (read <span class="org-string">"100"</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>))
100
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (print (read <span class="org-string">"10asd0"</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>))
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> Prelude.read<span class="org-haskell-type">:</span> no parse
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> ioExceptionTester <span class="org-haskell-definition">$</span> throw <span class="org-haskell-type">Underflow</span>
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> arithmetic underflow
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>   
<span class="org-haskell-operator">&gt;</span> ioExceptionTester <span class="org-haskell-definition">$</span> throw <span class="org-haskell-type">DivideByZero</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> divide by zero

<span class="org-comment-delimiter">--</span><span class="org-comment">- Async Exception - User interrupt </span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (putStrLn <span class="org-string">"Enter something"</span> <span class="org-haskell-operator">&gt;&gt;</span> getLine <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Enter</span> something
<span class="org-haskell-operator">^</span>CInterrupted.
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
</div>
