haskell/haskell_handling_exceptions.org
*** Catching Exceptions with catchIOError

The function =catchIOError :: IO a -> (IOError -> IO a) -> IO a= from
module [[https://hackage.haskell.org/package/base-4.9.0.0/docs/System-IO-Error.html][System.IO.Error]] is similar to the function catch, however it
only handles IOError(alias to IOExceptions). 

#+BEGIN_SRC haskell 
  import Control.Exception
  import System.IO.Error 

  :{
  ioExceptionTester thunk = catchIOError thunk handler 
    where
      handler e = do  
        putStrLn $ "Exception message = " ++ show e 
        case e of
          _ | isAlreadyExistsError e -> putStrLn "Error: Already Exists"
          _ | isDoesNotExistError e  -> putStrLn "Error: Doesn't exists"               
          _ | isEOFError e           -> putStrLn "Error: End of file"
          _ | isIllegalOperation e   -> putStrLn "Error: Illegal operation"
          _ | isPermissionError e    -> putStrLn "Error: Permission error"
          _ | isUserError e          -> putStrLn "Error: User error"              
          _                          -> do putStrLn "Error: I can't handler this type of error."
                                           ioError e -- Raise uncaught exception 
  :}


  > ioExceptionTester (readFile "/etc/issue" >>= putStrLn)
  Manjaro Linux \r  (\n) (\l)



  it :: ()
  > ioExceptionTester (readFile "/etc/issueasd" >>= putStrLn)
  Exception message = /etc/issueasd: openFile: does not exist (No such file or directory)
  Error: Doesn't exists
  it :: ()

  > ioExceptionTester (readFile "/etc/" >>= putStrLn)
  Exception message = /etc/: openFile: inappropriate type (is a directory)
  Error: I can't handler this type of error.
  ,*** Exception: /etc/: openFile: inappropriate type (is a directory)
  > 
  > 
  > ioExceptionTester (readFile "/dev/sda1" >>= putStrLn)
  Exception message = /dev/sda1: hGetContents: invalid argument (invalid byte sequence)
  Error: I can't handler this type of error.
  ,*** Exception: /dev/sda1: hGetContents: invalid argument (invalid byte sequence)
  > 
  > ioExceptionTester (readFile "/dev/tty0" >>= putStrLn)
  Exception message = /dev/tty0: openFile: permission denied (Permission denied)
  Error: Permission error
  it :: ()
  > 
  > ioExceptionTester (readFile "/dev/shadow" >>= putStrLn)
  Exception message = /dev/shadow: openFile: does not exist (No such file or directory)
  Error: Doesn't exists
  it :: ()
  > 
  > ioExceptionTester (readFile "/etc/shadow" >>= putStrLn)
  Exception message = /etc/shadow: openFile: permission denied (Permission denied)
  Error: Permission error
  it :: ()
  > 

  > ioExceptionTester (throw $ userError "I raised an Exception")
  Exception message = user error (I raised an Exception)
  Error: User error
  it :: ()
  > 
    

  {- ===== The exceptions below aren't caught by catchIOError ========== -}

  > ioExceptionTester (print $ div 10 0)
  ,*** Exception: divide by zero
  >

  > ioExceptionTester (print $ div 10 0)
  ,*** Exception: divide by zero
  > 
  > let x = undefined
  - 
  x :: a
  > ioExceptionTester (print $ x)
  ,*** Exception: Prelude.undefined
  CallStack (from HasCallStack):
    error, called at libraries/base/GHC/Err.hs:79:14 in base:GHC.Err
    undefined, called at <interactive>:51:5 in interactive:Ghci4
  > 
  > ioExceptionTester (error "Some error")
  ,*** Exception: Some error
  CallStack (from HasCallStack):
    error, called at <interactive>:55:20 in interactive:Ghci5
  >

  > ioExceptionTester (throw DivideByZero )
  ,*** Exception: divide by zero
    

  > ioExceptionTester (throw Underflow  )
  ,*** Exception: arithmetic underflow
  > 

    
#+END_SRC
