haskell/haskell_handling_exceptions.html

<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> Catching Exceptions with catchIOError</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
The function <code>catchIOError :: IO a -&gt; (IOError -&gt; IO a) -&gt; IO a</code> from
module <a href="https://hackage.haskell.org/package/base-4.9.0.0/docs/System-IO-Error.html">System.IO.Error</a> is similar to the function catch, however it
only handles IOError(alias to IOExceptions). 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Exception</span>
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">System.IO.Error</span> 

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">ioExceptionTester</span> thunk <span class="org-haskell-operator">=</span> catchIOError thunk handler 
  <span class="org-haskell-keyword">where</span>
    handler e <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>  
      putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"Exception message = "</span> <span class="org-haskell-operator">++</span> show e 
      <span class="org-haskell-keyword">case</span> e <span class="org-haskell-keyword">of</span>
        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> isAlreadyExistsError e <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: Already Exists"</span>
        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> isDoesNotExistError e  <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: Doesn't exists"</span>               
        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> isEOFError e           <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: End of file"</span>
        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> isIllegalOperation e   <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: Illegal operation"</span>
        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> isPermissionError e    <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: Permission error"</span>
        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> isUserError e          <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: User error"</span>              
        <span class="org-haskell-keyword">_</span>                          <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span> putStrLn <span class="org-string">"Error: I can't handler this type of error."</span>
                                         ioError e <span class="org-comment-delimiter">-- </span><span class="org-comment">Raise uncaught exception </span>
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (readFile <span class="org-string">"/etc/issue"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Manjaro</span> <span class="org-haskell-constructor">Linux</span> <span class="org-haskell-operator">\</span>r  (<span class="org-haskell-operator">\</span>n) (<span class="org-haskell-operator">\</span>l)



<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (readFile <span class="org-string">"/etc/issueasd"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/</span>issueasd<span class="org-haskell-constructor">:</span> openFile<span class="org-haskell-constructor">:</span> does not exist (<span class="org-haskell-constructor">No</span> such file or directory)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">Doesn't</span> exists
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (readFile <span class="org-string">"/etc/"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/:</span> openFile<span class="org-haskell-constructor">:</span> inappropriate <span class="org-haskell-keyword">type</span> (is a directory)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">I</span> can't handler this <span class="org-haskell-keyword">type</span> <span class="org-haskell-keyword">of</span> error<span class="org-haskell-operator">.</span>
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/:</span> openFile<span class="org-haskell-constructor">:</span> inappropriate <span class="org-haskell-keyword">type</span> (is a directory)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (readFile <span class="org-string">"/dev/sda1"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">/</span>dev<span class="org-haskell-operator">/</span>sda1<span class="org-haskell-constructor">:</span> hGetContents<span class="org-haskell-constructor">:</span> invalid argument (invalid byte sequence)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">I</span> can't handler this <span class="org-haskell-keyword">type</span> <span class="org-haskell-keyword">of</span> error<span class="org-haskell-operator">.</span>
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-operator">/</span>dev<span class="org-haskell-operator">/</span>sda1<span class="org-haskell-constructor">:</span> hGetContents<span class="org-haskell-constructor">:</span> invalid argument (invalid byte sequence)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (readFile <span class="org-string">"/dev/tty0"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">/</span>dev<span class="org-haskell-operator">/</span>tty0<span class="org-haskell-constructor">:</span> openFile<span class="org-haskell-constructor">:</span> permission denied (<span class="org-haskell-constructor">Permission</span> denied)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">Permission</span> error
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (readFile <span class="org-string">"/dev/shadow"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">/</span>dev<span class="org-haskell-operator">/</span>shadow<span class="org-haskell-constructor">:</span> openFile<span class="org-haskell-constructor">:</span> does not exist (<span class="org-haskell-constructor">No</span> such file or directory)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">Doesn't</span> exists
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (readFile <span class="org-string">"/etc/shadow"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/</span>shadow<span class="org-haskell-constructor">:</span> openFile<span class="org-haskell-constructor">:</span> permission denied (<span class="org-haskell-constructor">Permission</span> denied)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">Permission</span> error
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (throw <span class="org-haskell-operator">$</span> userError <span class="org-string">"I raised an Exception"</span>)
<span class="org-haskell-constructor">Exception</span> message <span class="org-haskell-operator">=</span> user error (<span class="org-haskell-constructor">I</span> raised an <span class="org-haskell-constructor">Exception</span>)
<span class="org-haskell-constructor">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">User</span> error
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">{- </span><span class="org-comment">===== The exceptions below aren't caught by catchIOError ========== -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (print <span class="org-haskell-operator">$</span> div 10 0)
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> divide by zero
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (print <span class="org-haskell-operator">$</span> div 10 0)
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> divide by zero
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> x <span class="org-haskell-operator">=</span> undefined
<span class="org-haskell-operator">-</span> 
<span class="org-haskell-definition">x</span> <span class="org-haskell-operator">::</span> a
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (print <span class="org-haskell-operator">$</span> x)
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> Prelude.undefined
<span class="org-haskell-constructor">CallStack</span> (from <span class="org-haskell-constructor">HasCallStack</span>)<span class="org-haskell-constructor">:</span>
  error, called at libraries<span class="org-haskell-operator">/</span>base<span class="org-haskell-operator">/</span><span class="org-haskell-constructor">GHC</span><span class="org-haskell-operator">/</span>Err.hs<span class="org-haskell-constructor">:</span>79<span class="org-haskell-constructor">:</span>14 <span class="org-haskell-keyword">in</span> base<span class="org-haskell-constructor">:GHC.Err</span>
  undefined, called at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>51<span class="org-haskell-constructor">:</span>5 <span class="org-haskell-keyword">in</span> interactive<span class="org-haskell-constructor">:Ghci4</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (error <span class="org-string">"Some error"</span>)
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">Some</span> error
<span class="org-haskell-constructor">CallStack</span> (from <span class="org-haskell-constructor">HasCallStack</span>)<span class="org-haskell-constructor">:</span>
  error, called at <span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>55<span class="org-haskell-constructor">:</span>20 <span class="org-haskell-keyword">in</span> interactive<span class="org-haskell-constructor">:Ghci5</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (throw <span class="org-haskell-constructor">DivideByZero</span> )
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> divide by zero


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ioExceptionTester</span> (throw <span class="org-haskell-constructor">Underflow</span>  )
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> arithmetic underflow
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
