haskell/haskell_handling_exceptions.org
*** Catching Exceptions using the function catches

#+BEGIN_SRC haskell 
  > import System.IO.Error 
  > import Control.Exception
  >
  > :set -XScopedTypeVariables
  >   

  > :t catches
  catches :: IO a -> [Handler a] -> IO a
  > 

  > :info Handler 
  data Handler a where
    Handler :: Exception e => (e -> IO a) -> Handler a
          -- Defined in ‘Control.Exception’
  instance Functor Handler -- Defined in ‘Control.Exception’
  > 


  let arithmeticHandler = putStrLn "Error I got an Arithmetic exception."

  :{
  ioExceptionHandler e
    | isAlreadyExistsError e = putStrLn "IO Exception - Already exists error"
    | isUserError e          = putStrLn "IO Exception - User Error"
    | otherwise              = do putStrLn "IO Exception - I don't know how to handle this exception"
                                  throw e 
  :}
  ioExceptionHandler :: IOError -> IO ()
  > 

  :{
  testCatches :: IO () -> IO ()
  testCatches thunk = catches thunk handlers
    where handlers = [  Handler $ \ (e :: ArithException) -> arithmeticHandler
                      , Handler $ \ (e :: IOError)        -> ioExceptionHandler e                                         
                      , Handler $ \ (e :: ErrorCall)      -> putStrLn "I got an ErrorCall exception"
                      , Handler $ \ (e :: SomeException)  -> do putStrLn "I don't know how to handle this exception"
                                                                throw e
                     ]

  :}

  > 
  > 
  > testCatches (throw DivideByZero)
  Error I got an Arithmetic exception.
  it :: ()
  > testCatches (throw Overflow )
  Error I got an Arithmetic exception.
  it :: ()
  > testCatches (let x = undefined in print x)
  I got an ErrorCall exception
  it :: ()
  > testCatches (error "Some Error")
  I got an ErrorCall exception
  it :: ()
  > testCatches (readFile "/etc/issue" >>= putStrLn)
  Manjaro Linux \r  (\n) (\l)



  it :: ()
  > testCatches (readFile "/etc/issuesf" >>= putStrLn)
  IO Exception - I don't know how to handle this exception
  ,*** Exception: /etc/issuesf: openFile: does not exist (No such file or directory)
  > 
  > testCatches (throw $ userError "throw my exception")
  IO Exception - User Error
  it :: ()
  > 
  > 

#+END_SRC
