haskell/haskell_handling_exceptions.html
<div id="outline-container-sec-1-3-5" class="outline-4">
<h4 id="sec-1-3-5"><span class="section-number-4">1.3.5</span> Catching Exceptions using the function catches</h4>
<div class="outline-text-4" id="text-1-3-5">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">System.IO.Error</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Exception</span>
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>set <span class="org-haskell-operator">-</span><span class="org-haskell-constructor">XScopedTypeVariables</span>
<span class="org-haskell-operator">&gt;</span>   

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t catches
<span class="org-haskell-definition">catches</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> a <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-type">Handler</span> a] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> a
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>info <span class="org-haskell-type">Handler</span> 
<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Handler</span> a <span class="org-haskell-keyword">where</span>
  <span class="org-haskell-constructor">Handler</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Exception</span> e <span class="org-haskell-operator">=&gt;</span> (e <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> a) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Handler</span> a
        <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Control.Exception&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Functor</span> <span class="org-haskell-type">Handler</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Control.Exception&#8217;</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-keyword">let</span> arithmeticHandler <span class="org-haskell-operator">=</span> putStrLn <span class="org-string">"Error I got an Arithmetic exception."</span>

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">ioExceptionHandler</span> e
  <span class="org-haskell-operator">|</span> isAlreadyExistsError e <span class="org-haskell-operator">=</span> putStrLn <span class="org-string">"IO Exception - Already exists error"</span>
  <span class="org-haskell-operator">|</span> isUserError e          <span class="org-haskell-operator">=</span> putStrLn <span class="org-string">"IO Exception - User Error"</span>
  <span class="org-haskell-operator">|</span> otherwise              <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span> putStrLn <span class="org-string">"IO Exception - I don't know how to handle this exception"</span>
                                throw e 
<span class="org-haskell-constructor">:</span>}
<span class="org-haskell-definition">ioExceptionHandler</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IOError</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-type">:</span>{
<span class="org-haskell-definition">testCatches</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">testCatches</span> thunk <span class="org-haskell-operator">=</span> catches thunk handlers
  <span class="org-haskell-keyword">where</span> handlers <span class="org-haskell-operator">=</span> [  <span class="org-haskell-constructor">Handler</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span> (e <span class="org-haskell-operator">::</span> <span class="org-haskell-type">ArithException</span>) <span class="org-haskell-operator">-&gt;</span> arithmeticHandler
                    , <span class="org-haskell-constructor">Handler</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span> (e <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IOError</span>)        <span class="org-haskell-operator">-&gt;</span> ioExceptionHandler e                                         
                    , <span class="org-haskell-constructor">Handler</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span> (e <span class="org-haskell-operator">::</span> <span class="org-haskell-type">ErrorCall</span>)      <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"I got an ErrorCall exception"</span>
                    , <span class="org-haskell-constructor">Handler</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span> (e <span class="org-haskell-operator">::</span> <span class="org-haskell-type">SomeException</span>)  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span> putStrLn <span class="org-string">"I don't know how to handle this exception"</span>
                                                              throw e
                   ]

<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testCatches</span> (throw <span class="org-haskell-constructor">DivideByZero</span>)
<span class="org-haskell-constructor">Error</span> <span class="org-haskell-constructor">I</span> got an <span class="org-haskell-constructor">Arithmetic</span> exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testCatches</span> (throw <span class="org-haskell-type">Overflow</span> )
<span class="org-haskell-constructor">Error</span> <span class="org-haskell-constructor">I</span> got an <span class="org-haskell-constructor">Arithmetic</span> exception<span class="org-haskell-operator">.</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testCatches</span> (<span class="org-haskell-keyword">let</span> x <span class="org-haskell-operator">=</span> undefined <span class="org-haskell-keyword">in</span> print x)
<span class="org-haskell-constructor">I</span> got an <span class="org-haskell-constructor">ErrorCall</span> exception
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testCatches</span> (error <span class="org-string">"Some Error"</span>)
<span class="org-haskell-constructor">I</span> got an <span class="org-haskell-constructor">ErrorCall</span> exception
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testCatches</span> (readFile <span class="org-string">"/etc/issue"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">Manjaro</span> <span class="org-haskell-constructor">Linux</span> <span class="org-haskell-operator">\</span>r  (<span class="org-haskell-operator">\</span>n) (<span class="org-haskell-operator">\</span>l)



<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testCatches</span> (readFile <span class="org-string">"/etc/issuesf"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn)
<span class="org-haskell-constructor">IO</span> <span class="org-haskell-constructor">Exception</span> <span class="org-haskell-operator">-</span> <span class="org-haskell-constructor">I</span> don't know how to handle this exception
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-operator">/</span>etc<span class="org-haskell-operator">/</span>issuesf<span class="org-haskell-constructor">:</span> openFile<span class="org-haskell-constructor">:</span> does not exist (<span class="org-haskell-constructor">No</span> such file or directory)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testCatches</span> (throw <span class="org-haskell-operator">$</span> userError <span class="org-string">"throw my exception"</span>)
<span class="org-haskell-constructor">IO</span> <span class="org-haskell-constructor">Exception</span> <span class="org-haskell-operator">-</span> <span class="org-haskell-constructor">User</span> <span class="org-haskell-constructor">Error</span>
<span class="org-haskell-definition">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Caio Rodrigues</p>
<p class="date">Created: 2017-03-05 dom 08:16</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>